declare var L: any;

const divisionsDataJSON = {
    "آذربایجان شرقی": {
        "آذرشهر": {
            "حومه": [
                "آذرشهر",
                "شیرامین",
                "قاضی جهان",
                "قبله داغی",
                "ینگجه"
            ],
            "ممقان": [
                "شهرک",
                "ممقان"
            ],
            "گوگان": [
                "تیمورلو",
                "دستجرد",
                "گوگان"
            ]
        },
        "اسکو": {
            "ایلخچی": [
                "ایلخچی",
                "جزیره",
                "شورکات جنوبی"
            ],
            "مرکزی": [
                "اسکو",
                "باویل",
                "سهند",
                "گنبر"
            ]
        },
        "اهر": {
            "فندقلو": [
                "قشلاق",
                "نقدوز"
            ],
            "مرکزی": [
                "آذغان",
                "اهر",
                "اوچ هاچا",
                "بزکش",
                "ورگهان",
                "گویجه بل"
            ]
        },
        "بستان آباد": {
            "تیکمه داش": [
                "اوجان شرقی",
                "تیکمه داش",
                "سهندآباد",
                "عبا س  شرقی",
                "عباس غربی"
            ],
            "مرکزی": [
                "اوجان غربی",
                "بستان آباد",
                "شبلی",
                "قوریگل",
                "مهرانرودجنوبی",
                "مهرانرودمرکزی",
                "کردکندی"
            ]
        },
        "بناب": {
            "مرکزی": [
                "بناب",
                "بناجوی شرقی",
                "بناجوی شمالی",
                "بناجوی غربی",
                "خوشه مهر"
            ]
        },
        "تبریز": {
            "باسمنج": [
                "باسمنج",
                "مهران رود",
                "میدان چای"
            ],
            "خسروشاه": [
                "اسفهلان",
                "تازه کند",
                "خسروشاه",
                "لاهیجان"
            ],
            "مرکزی": [
                "آجی چای",
                "اسپران",
                "تبریز",
                "تبریز 10",
                "تبریز 9",
                "تبریز1-",
                "تبریز2-",
                "تبریز3-",
                "تبریز4-",
                "تبریز5",
                "تبریز6",
                "تبریز7",
                "تبریز8",
                "سردرود",
                "سردصحرا"
            ]
        },
        "جلفا": {
            "سیه رود": [
                "دیزمارغربی",
                "سیه رود",
                "نوجه مهر"
            ],
            "مرکزی": [
                "ارسی",
                "جلفا",
                "داران",
                "شجاع",
                "هادیشهر"
            ]
        },
        "خداآفرین": {
            "مرکزی": [
                "بسطاملو",
                "خمارلو",
                "کیوان"
            ],
            "منجوان": [
                "دیزمارشرقی",
                "عاشقلو",
                "منجوان شرقی",
                "منجوان غربی"
            ],
            "گرمادوز": [
                "لاریجان",
                "گرما دوزغربی",
                "گرمادوزشرقی"
            ]
        },
        "سراب": {
            "مرکزی": [
                "آغمیون",
                "ابرغان",
                "حومه",
                "رازلیق",
                "سراب",
                "صایین",
                "ملایعقوب"
            ],
            "مهربان": [
                "آلان برآغوش",
                "اردلان",
                "دوزدوزان",
                "شربیان",
                "مهربان"
            ]
        },
        "شبستر": {
            "تسوج": [
                "تسوج",
                "چهرگان",
                "گونی غربی"
            ],
            "صوفیان": [
                "رودقات",
                "صوفیان",
                "میشوجنوبی",
                "چله خانه"
            ],
            "مرکزی": [
                "خامنه",
                "داریان",
                "سیس",
                "شبستر",
                "شرفخانه",
                "شندآباد",
                "علیشاه",
                "وایقان",
                "کوزه کنان",
                "گونی شرقی",
                "گونی مرکزی"
            ]
        },
        "عجب شیر": {
            "قلعه چای": [
                "جوان قلعه",
                "دیزجرودشرقی",
                "کوهستان"
            ],
            "مرکزی": [
                "خضرلو",
                "دیزجرودغربی",
                "عجب شیر"
            ]
        },
        "لیلان": {
            "شیرین کند": [
                "لیلان شرقی",
                "لیلان شمالی"
            ],
            "مرکزی": [
                "لیلان",
                "لیلان جنوبی",
                "لیلان غربی"
            ]
        },
        "مراغه": {
            "سراجو": [
                "خداجو(خراجو)",
                "سراجوی جنوبی",
                "سراجوی شرقی",
                "قوری چای غربی"
            ],
            "مرکزی": [
                "سراجوی شمالی",
                "سراجوی غربی",
                "قره ناز",
                "مراغه",
                "مراغه 1",
                "مراغه 2"
            ]
        },
        "مرند": {
            "مرکزی": [
                "بناب",
                "بناب مرند",
                "دولت آباد",
                "زنوز",
                "زنوزق",
                "مرند",
                "میشاب شمالی",
                "هرزندات شرقی",
                "هرزندات غربی"
            ],
            "کشکسرای": [
                "دیزج حسین بیگ",
                "کشکسرای",
                "یالقوز آغاج"
            ],
            "یامچی": [
                "ذوالبین",
                "یامچی",
                "یکانات"
            ]
        },
        "ملکان": {
            "آق منار": [
                "گاودول جنوبی",
                "گاودول شرقی"
            ],
            "مرکزی": [
                "مبارک شهر",
                "ملکان",
                "گاودول غربی",
                "گاودول مرکزی"
            ]
        },
        "میانه": {
            "ترکمانچای": [
                "اوچ تپه غربی",
                "بروانان شرقی",
                "بروانان غربی",
                "بروانان مرکزی",
                "ترکمانچای"
            ],
            "مرکزی": [
                "اوچ تپه شرقی",
                "اچاچی",
                "شیخ درآباد",
                "قافلانکوه غربی",
                "قزل اوزن",
                "میانه",
                "کله بوزشرقی",
                "کله بوزغربی",
                "گرمه جنوبی"
            ],
            "کاغذکنان": [
                "آقکند",
                "قافلانکوه شرقی",
                "کاغذکنان شمالی",
                "کاغذکنان مرکزی"
            ],
            "کندوان": [
                "ترک",
                "تیرچایی",
                "کندوان",
                "گرمه شمالی"
            ]
        },
        "هریس": {
            "خواجه": [
                "اربطان",
                "بدوستان غربی",
                "خواجه",
                "مواضع خان شرقی",
                "مواضع خان شمالی"
            ],
            "مرکزی": [
                "باروق",
                "بخشایش",
                "بدوستان شرقی",
                "خانمرود",
                "زرنق",
                "هریس",
                "کلوانق"
            ]
        },
        "هشترود": {
            "مرکزی": [
                "سلوک",
                "علی آباد",
                "قرانقو",
                "هشترود",
                "چاراویماق شمالشرقی",
                "کوهسار"
            ],
            "نظرکهریزی": [
                "آلمالو",
                "نظرکهریزی"
            ]
        },
        "هوراند": {
            "مرکزی": [
                "دودانگه",
                "دیکله",
                "هوراند"
            ],
            "چهاردانگه": [
                "چهاردانگه جنوبی",
                "چهاردانگه شمالی"
            ]
        },
        "ورزقان": {
            "خاروانا": [
                "ارزیل",
                "جوشین",
                "خاروانا",
                "دیزمارمرکزی"
            ],
            "مرکزی": [
                "ازومدل جنوبی",
                "ازومدل شمالی",
                "بکرآباد",
                "سینا",
                "ورزقان"
            ]
        },
        "چاراویماق": {
            "شادیان": [
                "چاراویماق جنوب شرقی",
                "چاراویماق شرقی"
            ],
            "مرکزی": [
                "قره آغاج",
                "قوری چای شرقی",
                "ورقه",
                "چاراویماق جنوب غربی",
                "چاراویماق مرکزی"
            ]
        },
        "کلیبر": {
            "آبش احمد": [
                "آبش احمد",
                "سیدان",
                "قشلاق"
            ],
            "مرکزی": [
                "مولان",
                "میشه پاره",
                "پیغان چایی",
                "کلیبر",
                "ییلاق"
            ]
        }
    },
    "آذربایجان غربی": {
        "ارومیه": {
            "انزل": [
                "انزل جنوبی",
                "انزل شمالی",
                "قوشچی"
            ],
            "سیلوانه": [
                "ترگور",
                "دشت",
                "سیلوانه",
                "مرگور"
            ],
            "صومای برادوست": [
                "برادوست",
                "سرو",
                "صومای جنوبی",
                "صومای شمالی"
            ],
            "مركزی": [
                "ارومیه",
                "ارومیه  5",
                "ارومیه 1",
                "ارومیه 2",
                "ارومیه 3",
                "ارومیه 4",
                "باراندوز",
                "باراندوزچای جنوبی",
                "باراندوزچای شمالی",
                "باش قلعه",
                "بكشلوچای",
                "تركمان",
                "دول",
                "روضه چای",
                "نازلوی جنوبی"
            ],
            "نازلو": [
                "طلاتپه",
                "نازلوشمالی",
                "نازلوچای",
                "نوشین"
            ]
        },
        "اشنویه": {
            "مركزی": [
                "اشنویه",
                "اشنویه شمالی",
                "دشت بیل"
            ],
            "نالوس": [
                "اشنویه جنوبی",
                "نالوس",
                "هق"
            ]
        },
        "باروق": {
            "مرکزی": [
                "باروق",
                "نادرگلی"
            ],
            "نختالو": [
                "آجرلوی شرقی",
                "آجرلوی غربی"
            ]
        },
        "بوكان": {
            "سیمینه": [
                "آختاچی شرقی",
                "آختاچی محالی",
                "بهی دهبكری",
                "سیمینه"
            ],
            "مركزی": [
                "آختاچی",
                "ایل تیمور",
                "ایل گورك",
                "بهی فیض اله بیگی",
                "بوكان"
            ]
        },
        "تكاب": {
            "تخت سلیمان": [
                "احمدآباد",
                "تخت سلیمان",
                "ساروق",
                "چمن"
            ],
            "مركزی": [
                "افشار",
                "انصار",
                "تكاب",
                "كرفتو"
            ]
        },
        "خوی": {
            "ایواوغلی": [
                "ایواوغلی",
                "ولدیان"
            ],
            "صفاییه": [
                "الند",
                "زرآباد",
                "سكمن آباد"
            ],
            "فیرورق": [
                "فیرورق",
                "فیرورق جنوبی",
                "فیرورق شمالی"
            ],
            "قطور": [
                "زری",
                "قطور"
            ],
            "مركزی": [
                "خوی",
                "دیزج",
                "دیزج دیز",
                "رهال",
                "قره سو",
                "گوهران"
            ]
        },
        "سردشت": {
            "ربط": [
                "باسک کولسه",
                "ربط",
                "نلاس",
                "گورک سردشت"
            ],
            "مركزی": [
                "آلان",
                "بریاجی",
                "سردشت"
            ]
        },
        "سلماس": {
            "كوهسار": [
                "شناتال",
                "شپیران",
                "چهریق"
            ],
            "مركزی": [
                "تازه شهر",
                "زولاچای",
                "سلماس",
                "كره سنی",
                "كنارپروژ",
                "لكستان"
            ]
        },
        "شاهین دژ": {
            "كشاورز": [
                "كشاورز",
                "چهاردولی",
                "کشاور"
            ],
            "مركزی": [
                "شاهین دژ",
                "صفاخانه",
                "محمودآباد",
                "هولاسو"
            ]
        },
        "شوط": {
            "قره قویون": [
                "قره قویون جنوبی",
                "مرگنلر",
                "چشمه سرا"
            ],
            "مركزی": [
                "شوط",
                "قره قویون شمالی",
                "یولاگلدی"
            ]
        },
        "ماكو": {
            "بازرگان": [
                "بازرگان",
                "ساری سو",
                "چایباسارشمالی"
            ],
            "مركزی": [
                "قره سو",
                "قلعه دره سی",
                "ماكو",
                "چایباسارجنوبی"
            ]
        },
        "مهاباد": {
            "خلیفان": [
                "خلیفان",
                "كانی بازار",
                "منگورشرقی"
            ],
            "مركزی": [
                "آختاچی غربی",
                "مكریان شرقی",
                "مكریان غربی",
                "مهاباد",
                "گوگ تپه"
            ]
        },
        "میاندوآب": {
            "بکتاش": [
                "بکتاش",
                "زرینه رود",
                "مظفرآباد"
            ],
            "مركزی": [
                "زرینه رودجنوبی",
                "زرینه رودشمالی",
                "مرحمت آباد",
                "مرحمت آبادجنوبی",
                "مكریان شمالی",
                "میاندوآب"
            ]
        },
        "میرآباد": {
            "زاب": [
                "ملکاری شرقی",
                "ملکاری غربی"
            ],
            "مرکزی": [
                "ساوان",
                "میرآباد",
                "گورک نعلین"
            ]
        },
        "نقده": {
            "محمدیار": [
                "المهدی",
                "حسنلو",
                "محمدیار"
            ],
            "مركزی": [
                "بیگم قلعه",
                "سلدوز",
                "نقده"
            ]
        },
        "پلدشت": {
            "ارس": [
                "نازك علیا",
                "گچلرات شرقی",
                "گچلرات غربی"
            ],
            "مركزی": [
                "زنگبار",
                "پلدشت",
                "چایباسارشرقی"
            ]
        },
        "پیرانشهر": {
            "لاجان": [
                "لاجان",
                "لاهیجان شرقی",
                "لاهیجان غربی"
            ],
            "مركزی": [
                "لاهیجان",
                "منگورغربی",
                "پیران",
                "پیرانشهر"
            ]
        },
        "چالدران": {
            "دشتك": [
                "آواجیق",
                "آواجیق جنوبی",
                "آواجیق شمالی"
            ],
            "مركزی": [
                "ببه جیك",
                "سیه چشمه",
                "چالدران جنوبی",
                "چالدران شمالی"
            ]
        },
        "چایپاره": {
            "حاجیلار": [
                "حاجیلار",
                "حاجیلارجنوبی",
                "حاجیلارشمالی"
            ],
            "مركزی": [
                "بسطام",
                "قره ضیاءالدین",
                "چورس"
            ]
        },
        "چهاربرج": {
            "فیروزآباد": [
                "فسندوز",
                "مرحمت آبادمیانی"
            ],
            "مرکزی": [
                "قپچاق",
                "مرحمت آبادشمالی",
                "چهاربرج"
            ]
        }
    },
    "اردبیل": {
        "اردبیل": {
            "ثمرین": [
                "ثمرین",
                "دوجاق",
                "غربی"
            ],
            "مركزی": [
                "اردبیل",
                "اردبیل 1",
                "اردبیل 2",
                "اردبیل 3",
                "اردبیل 4",
                "اردبیل 5",
                "ارشق شرقی",
                "بالغلو",
                "سردابه",
                "شرقی",
                "كلخوران"
            ],
            "هیر": [
                "آراللو",
                "فولادلوی جنوبی",
                "فولادلوی شمالی",
                "هیر"
            ]
        },
        "اصلاندوز": {
            "بران": [
                "بران",
                "بران علیا",
                "قشلاق غربی"
            ],
            "مرکزی": [
                "اصلاندوز",
                "اصلاندوز شرقی",
                "اصلاندوز غربی"
            ]
        },
        "انگوت": {
            "دره رود": [
                "دره رود جنوبی",
                "دره رود شمالی",
                "زیوه"
            ],
            "مرکزی": [
                "انگوت شرقی",
                "انگوت غربی",
                "تازه کندانگوت"
            ]
        },
        "بیله سوار": {
            "قشلاق دشت": [
                "جعفرآباد",
                "قشلاق جنوبی",
                "قشلاق شرقی"
            ],
            "مركزی": [
                "انجیرلو",
                "بیله سوار",
                "گوگ تپه"
            ]
        },
        "خلخال": {
            "خورش رستم": [
                "خورش رستم جنوبی",
                "خورش رستم شمالی",
                "هشتجین"
            ],
            "شاهرود": [
                "شال",
                "شاهرود",
                "كلور",
                "پلنگا"
            ],
            "مركزی": [
                "خانندبیل شرقی",
                "خانندبیل غربی",
                "خلخال",
                "سنجبدشرقی"
            ]
        },
        "سرعین": {
            "سبلان": [
                "ارجستان",
                "اردیموسی",
                "سبلان"
            ],
            "مركزی": [
                "آب گرم",
                "الوارس",
                "سرعین"
            ]
        },
        "كوثر": {
            "فیروز": [
                "زرج آباد",
                "سنجبدجنوبی",
                "فیروزآباد"
            ],
            "مركزی": [
                "سنجبدشمالی",
                "سنجبدغربی",
                "گیوی"
            ]
        },
        "مشگین شهر": {
            "ارشق": [
                "ارشق شمالی",
                "ارشق مركزی",
                "رضی"
            ],
            "قصابه": [
                "شعبان",
                "قصابه",
                "مشگین غربی"
            ],
            "مرادلو": [
                "ارشق غربی",
                "صلوات",
                "مرادلو",
                "یافت"
            ],
            "مركزی": [
                "النی",
                "دشت",
                "مشگین شرقی",
                "مشگین شهر"
            ],
            "مشكین شرقی": [
                "فخراباد",
                "قره سو",
                "لاهرود",
                "نقدی"
            ]
        },
        "نمین": {
            "عنبران": [
                "عنبران",
                "میناباد"
            ],
            "مركزی": [
                "دولت آباد",
                "نمین",
                "ویلكیج شمالی",
                "گرده"
            ],
            "ویلكیج": [
                "آبی بیگلو",
                "ویلكیج جنوبی",
                "ویلكیج مركزی"
            ]
        },
        "نیر": {
            "كوراییم": [
                "كوراییم",
                "مهماندوست",
                "یورتچی شرقی"
            ],
            "مركزی": [
                "دورسونخواجه",
                "رضاقلی قشلاق",
                "نیر",
                "یورتچی غربی"
            ]
        },
        "پارس آباد": {
            "اسلام آباد": [
                "اسلام آباد",
                "اسلام اباد",
                "شهرک"
            ],
            "تازه كند": [
                "تازه كند",
                "محمودآباد",
                "مغان سر"
            ],
            "مركزی": [
                "اولتان",
                "ساوالان",
                "پارس آباد"
            ]
        },
        "گرمی": {
            "مركزی": [
                "اجارودشمالی",
                "اجارودغربی",
                "اجارودمركزی",
                "انی",
                "پایین برزند",
                "گرمی"
            ],
            "موران": [
                "آزادلو",
                "اجارودشرقی",
                "زهرا"
            ]
        }
    },
    "اصفهان": {
        "آران و بیدگل": {
            "مرکزی": [
                "آران و بیدگل",
                "سفید شهر",
                "سفیددشت",
                "نوش آباد"
            ],
            "کویرات": [
                "ابوزیدآباد",
                "کویر",
                "کویرات"
            ]
        },
        "اردستان": {
            "زواره": [
                "ریگستان",
                "زواره",
                "سفلی"
            ],
            "مرکزی": [
                "اردستان",
                "برزاوند",
                "علیا",
                "کچو"
            ],
            "مهاباد": [
                "مهاباد",
                "همبرات",
                "گرمسیر"
            ]
        },
        "اصفهان": {
            "مرکزی": [
                "اصفهان",
                "اصفهان 1",
                "اصفهان 10",
                "اصفهان 11",
                "اصفهان 12",
                "اصفهان 13",
                "اصفهان 14",
                "اصفهان 15",
                "اصفهان 2",
                "اصفهان 3",
                "اصفهان 4",
                "اصفهان 5",
                "اصفهان 6",
                "اصفهان 7",
                "اصفهان 8",
                "اصفهان 9",
                "براآن جنوبی",
                "براآن شمالی",
                "بهارستان",
                "جی",
                "زیار",
                "قهاب جنوبی",
                "قهاب شمالی",
                "قهجاورستان",
                "محمودآباد",
                "کرارج"
            ]
        },
        "برخوار": {
            "حبیب آباد": [
                "برخوار شرقی",
                "حبیب آباد",
                "شاپورآباد",
                "کمشچه"
            ],
            "مرکزی": [
                "برخوار مرکزی",
                "خورزوق",
                "دستگرد",
                "دولت آباد",
                "سین"
            ]
        },
        "بویین و میاندشت": {
            "مرکزی": [
                "افوس",
                "بویین و میاندشت",
                "سردسیر",
                "گرجی",
                "ییلاق"
            ],
            "کرچمبو": [
                "کرچمبوجنوبی",
                "کرچمبوشمالی"
            ]
        },
        "تیران وکرون": {
            "مرکزی": [
                "تیران",
                "رضوانشهر",
                "رضوانیه",
                "ورپشت"
            ],
            "کرون": [
                "عسگران",
                "کرون سفلی",
                "کرون علیا"
            ]
        },
        "جرقویه": {
            "جرقویه علیا": [
                "جرقویه علیا",
                "حسن اباد",
                "رامشه"
            ],
            "مرکزی": [
                "جرقویه سفلی",
                "جرقویه وسطی",
                "محمدآباد",
                "نصرآباد",
                "نیک آباد"
            ]
        },
        "خمینی شهر": {
            "مرکزی": [
                "اصغرآباد",
                "خمینی شهر",
                "درچه",
                "ماربین سفلی",
                "ماربین علیا",
                "ماربین وسطی",
                "کوشک"
            ]
        },
        "خوانسار": {
            "مرکزی": [
                "خوانسار",
                "ویست",
                "چشمه سار",
                "کوهسار",
                "گلسار"
            ]
        },
        "خور و بیابانک": {
            "مرکزی": [
                "بیابانک",
                "جندق",
                "خور",
                "فرخی",
                "نخلستان"
            ]
        },
        "دهاقان": {
            "مرکزی": [
                "دهاقان",
                "قمبوان",
                "موسی آباد",
                "همگین",
                "گلشن"
            ]
        },
        "سمیرم": {
            "مرکزی": [
                "حنا",
                "سمیرم",
                "ونک"
            ],
            "وردشت": [
                "دره شور",
                "فتح آباد",
                "وردشت"
            ],
            "پادنا": [
                "پادنا سفلی",
                "پادنا وسطی",
                "کمه"
            ],
            "پادنا علیا": [
                "برآفتاب",
                "بیده",
                "پادنا علیا"
            ]
        },
        "شاهین شهرو میمه": {
            "مرکزی": [
                "برخوار غربی",
                "شاهین شهر",
                "مورچه خورت",
                "گرگاب",
                "گزبرخوار"
            ],
            "میمه": [
                "زرکان",
                "لای بید",
                "میمه",
                "وزوان",
                "ونداده"
            ]
        },
        "شهرضا": {
            "مرکزی": [
                "اسفرجان",
                "دشت",
                "شهرضا",
                "منظریه",
                "کهرویه"
            ]
        },
        "فریدن": {
            "زنده رود": [
                "قره بیشه",
                "ورزق"
            ],
            "مرکزی": [
                "داران",
                "دالانکوه",
                "دامنه",
                "زاینده رود شمالی",
                "ورزق جنوبی"
            ]
        },
        "فریدونشهر": {
            "مرکزی": [
                "برف انبار",
                "عشایر",
                "فریدونشهر",
                "چشمه لنگان"
            ],
            "موگویی": [
                "پشتکوه موگویی",
                "پیشکوه موگویی"
            ]
        },
        "فلاورجان": {
            "قهدریجان": [
                "زازران",
                "قهدریجان",
                "گلستان"
            ],
            "مرکزی": [
                "ابریشم",
                "اشترجان",
                "بوستان زر",
                "فلاورجان",
                "مینادشت",
                "کلیشاد و سودرجان"
            ],
            "پیربکران": [
                "بهاران شهر",
                "سهروفیروزان",
                "طاد",
                "پیربکران",
                "گرکن شمالی"
            ]
        },
        "لنجان": {
            "باغ بهادران": [
                "باغ بهادران",
                "زیرکوه",
                "چرمهین",
                "چم رود",
                "چم کوه"
            ],
            "مرکزی": [
                "اشیان",
                "باغشاد",
                "خرم رود",
                "زاینده رود",
                "زرین شهر",
                "سده لنجان",
                "فولادشهر",
                "ورنامخواست",
                "چمگردان"
            ]
        },
        "مبارکه": {
            "مرکزی": [
                "دیزیچه",
                "طالخونچه",
                "مبارکه",
                "مجلسی",
                "کرکوند"
            ],
            "گرکن جنوبی": [
                "ده سرخ",
                "زیباشهر",
                "نورآباد",
                "گرکن"
            ]
        },
        "نایین": {
            "انارک": [
                "انارک",
                "چوپانان"
            ],
            "مرکزی": [
                "بافران",
                "بهارستان",
                "لای سیاه",
                "نایین",
                "کوهستان"
            ]
        },
        "نجف آباد": {
            "مرکزی": [
                "جوزدان",
                "صادقیه",
                "صفاییه",
                "نجف آباد",
                "کهریزسنگ",
                "گلدشت"
            ],
            "مهردشت": [
                "اشن",
                "حسین آباد",
                "دهق",
                "علویجه"
            ]
        },
        "نطنز": {
            "امام زاده": [
                "امامزاده آقا علی عباس",
                "بادرود",
                "خالدآباد"
            ],
            "مرکزی": [
                "برزرود",
                "طرق رود",
                "نطنز",
                "کرکس"
            ]
        },
        "هرند": {
            "اژیه": [
                "اژیه",
                "رودشت",
                "کلیشاد"
            ],
            "مرکزی": [
                "امامزاده عبدالعزیز",
                "هاشم آباد",
                "هرند"
            ]
        },
        "ورزنه": {
            "رودشت": [
                "رودشت شرقی",
                "کفرود"
            ],
            "مرکزی": [
                "ورزنه",
                "گاوخونی جنوبی",
                "گاوخونی شمالی"
            ]
        },
        "چادگان": {
            "مرکزی": [
                "رزوه",
                "چادگان",
                "کاوه آهنگر",
                "کبوترسرخ"
            ],
            "چنارود": [
                "چنارود جنوبی",
                "چنارود شمالی"
            ]
        },
        "کاشان": {
            "برزک": [
                "باباافضل",
                "برزک",
                "گلاب"
            ],
            "قمصر": [
                "جوشقان قالی",
                "قمصر",
                "قهرود",
                "کامو و چوگان"
            ],
            "مرکزی": [
                "خرم دشت",
                "مشکات",
                "میاندشت",
                "کاشان",
                "کوهپایه"
            ],
            "نیاسر": [
                "نیاسر",
                "کوه دشت"
            ]
        },
        "کوهپایه": {
            "تودشک": [
                "تودشک",
                "جبل",
                "کوهپایه"
            ],
            "سیستان": [
                "زفره",
                "سجزی",
                "سیستان"
            ]
        },
        "گلپایگان": {
            "مرکزی": [
                "جلگه",
                "نیوان",
                "کناررودخانه",
                "گلشهر",
                "گلپایگان",
                "گوگد"
            ]
        }
    },
    "البرز": {
        "اشتهارد": {
            "مرکزی": [
                "اشتهارد",
                "ایپک",
                "صحت آباد"
            ],
            "پلنگ آباد": [
                "جارو",
                "پلنگ آباد"
            ]
        },
        "ساوجبلاغ": {
            "مرکزی": [
                "سعیدآباد",
                "مهستان",
                "هشتگرد",
                "هیو",
                "گلسار"
            ],
            "چندار": [
                "برغان",
                "چندار",
                "کوهسار"
            ]
        },
        "طالقان": {
            "بالا طالقان": [
                "جوستان",
                "کنار رود"
            ],
            "مرکزی": [
                "طالقان",
                "میان طالقان",
                "پایین طالقان"
            ]
        },
        "فردیس": {
            "مرکزی": [
                "فردیس",
                "فردیس 1",
                "فردیس 2",
                "وحدت"
            ],
            "مشکین دشت": [
                "فرخ آباد",
                "مشکین آباد",
                "مشکین دشت"
            ]
        },
        "نظرآباد": {
            "تنکمان": [
                "تنکمان",
                "تنکمان جنوبی",
                "تنکمان شمالی"
            ],
            "مرکزی": [
                "احمدآباد",
                "جمال الدین",
                "نجم آباد",
                "نظرآباد"
            ]
        },
        "چهارباغ": {
            "بخش رامجین": [
                "اغلان تپه",
                "رامجین"
            ],
            "مرکزی": [
                "عرب آباد افشار",
                "چهارباغ",
                "چهاردانگه"
            ]
        },
        "کرج": {
            "آسارا": [
                "آدران",
                "آسارا",
                "نساء"
            ],
            "مرکزی": [
                "ماهدشت",
                "محمد شهر",
                "محمدآباد",
                "کرج",
                "کرج  1",
                "کرج  10",
                "کرج  2",
                "کرج  3",
                "کرج  4",
                "کرج  5",
                "کرج  6",
                "کرج  7",
                "کرج  8",
                "کرj  9",
                "کمال آباد",
                "کمال شهر",
                "گرمدره"
            ]
        }
    },
    "ایلام": {
        "آبدانان": {
            "سراب باغ": [
                "سراب باغ",
                "وچ کبود"
            ],
            "كلات": [
                "آب انار",
                "مورموری"
            ],
            "مركزی": [
                "آبدانان",
                "جابرانصار",
                "ماسبی"
            ]
        },
        "ایلام": {
            "سیوان": [
                "جعفراباد",
                "محمود آباد",
                "میش خاص"
            ],
            "مركزی": [
                "ایلام",
                "ایلام 1",
                "ایلام 2",
                "ده پایین",
                "کشوری"
            ]
        },
        "ایوان": {
            "زرنه": [
                "زرنه",
                "كلان"
            ],
            "مركزی": [
                "ایوان",
                "سراب",
                "نبوت"
            ]
        },
        "بدره": {
            "مرکزی": [
                "بدره",
                "دوستان",
                "علیشروان",
                "کلم"
            ],
            "هندمینی": [
                "زرانگوش",
                "هندمینی",
                "چشمه شیرین"
            ]
        },
        "دره شهر": {
            "ماژین": [
                "كولكنی",
                "ماژین"
            ],
            "مركزی": [
                "ارمو",
                "دره شهر",
                "زرین دشت"
            ]
        },
        "دهلران": {
            "دشت عباس": [
                "ابوغویر",
                "دشت عباس"
            ],
            "زرین آباد": [
                "سیدابراهیم",
                "سیدناصرالدین",
                "پهله"
            ],
            "سراب میمه": [
                "تختان",
                "میمه",
                "گوراب"
            ],
            "مركزی": [
                "اناران",
                "دهلران"
            ],
            "موسیان": [
                "دال پری",
                "موسیان",
                "نهرعنبر"
            ]
        },
        "سیروان": {
            "مرکزی": [
                "رودبار",
                "لومار"
            ],
            "کارزان": [
                "زنگوان",
                "کارزان"
            ]
        },
        "ملكشاهی": {
            "مركزی": [
                "اركواز",
                "شوهان",
                "چمزی"
            ],
            "گچی": [
                "دلگشا",
                "كبیركوه",
                "مهر",
                "گچی"
            ]
        },
        "مهران": {
            "صالح آباد": [
                "صالح آباد",
                "هجداندشت"
            ],
            "مركزی": [
                "محسن آب",
                "مهران"
            ]
        },
        "هلیلان": {
            "جزمان": [
                "داربید",
                "زردلان"
            ],
            "مرکزی": [
                "توحید",
                "داجیوند",
                "گوران"
            ]
        },
        "چرداول": {
            "آسمان آباد": [
                "آسمان آباد",
                "کل کل"
            ],
            "زاگرس": [
                "بلاوه",
                "بیجنوند",
                "قلعه"
            ],
            "شباب": [
                "زنجیره",
                "شباب"
            ],
            "مركزی": [
                "سرابله",
                "هلسم"
            ]
        },
        "چوار": {
            "بولی": [
                "بولی",
                "چکر"
            ],
            "مرکزی": [
                "ارکوازی",
                "حاجی بختیار",
                "چوار"
            ]
        }
    },
    "بوشهر": {
        "بوشهر": {
            "خارك": [
                "خارك"
            ],
            "مركزی": [
                "انگالی",
                "بوشهر",
                "بوشهر1",
                "بوشهر2",
                "حومه",
                "عالی شهر"
            ],
            "چغادک": [
                "دویره",
                "چاه کوتاه",
                "چغادک"
            ]
        },
        "تنگستان": {
            "دلوار": [
                "بوالخیر",
                "دلوار"
            ],
            "مركزی": [
                "آباد",
                "اهرم",
                "باغك"
            ]
        },
        "جم": {
            "ریز": [
                "انارستان",
                "تشان",
                "ریز"
            ],
            "مركزی": [
                "بهارستان",
                "جم",
                "كوری"
            ]
        },
        "دشتستان": {
            "آب پخش": [
                "آب پخش",
                "درواهی",
                "دشتی اسماعیل خانی"
            ],
            "ارم": [
                "ارم",
                "تنگ ارم",
                "دهرود"
            ],
            "بوشكان": [
                "بوشكان",
                "بوشکان",
                "كلمه",
                "پشتكوه"
            ],
            "سعدآباد": [
                "زیرراه",
                "سعد آباد",
                "وحدتیه"
            ],
            "شبانكاره": [
                "شبانكاره"
            ],
            "مركزی": [
                "برازجان",
                "حومه",
                "دالكی",
                "زیارت"
            ]
        },
        "دشتی": {
            "شنبه و طسوج": [
                "شنبه",
                "طسوج"
            ],
            "كاكی": [
                "بادوله",
                "كاكی",
                "كبگان",
                "چغاپور"
            ],
            "مركزی": [
                "خورموج",
                "مركزی"
            ]
        },
        "دیر": {
            "آبدان": [
                "آبدان",
                "سرمستان"
            ],
            "بردخون": [
                "آبكش",
                "بردخون"
            ],
            "مركزی": [
                "اولی",
                "بردستان",
                "بندردیر",
                "حومه",
                "دوراهک"
            ]
        },
        "دیلم": {
            "امام حسن": [
                "امام حسن",
                "لیراوی جنوبی",
                "لیراوی میانی"
            ],
            "مركزی": [
                "بندردیلم",
                "حومه",
                "لیراوی شمالی"
            ]
        },
        "عسلویه": {
            "مرکزی": [
                "اخند",
                "بیدخون",
                "عسلویه",
                "نخل تقی"
            ],
            "چاه مبارک": [
                "نای بند",
                "چاه مبارک"
            ]
        },
        "كنگان": {
            "سیراف": [
                "سیراف",
                "شیرینو",
                "طاهری"
            ],
            "مركزی": [
                "بندركنگان",
                "بنك",
                "تمبک",
                "حومه"
            ]
        },
        "گناوه": {
            "ریگ": [
                "بندرریگ",
                "رودحله"
            ],
            "مركزی": [
                "بندرگناوه",
                "حیات داود"
            ]
        }
    },
    "تهران": {
        "اسلامشهر": {
            "احمد آباد مستوفی": [
                "احمد آباد مستوفی",
                "چیچکلو"
            ],
            "مركزی": [
                "اسلام شهر1",
                "اسلام شهر2",
                "اسلام شهر3",
                "اسلام شهر6",
                "اسلامشهر",
                "بهرام آباد",
                "ده عباس"
            ],
            "چهاردانگه": [
                "فیروزبهرام",
                "چهاردانگه"
            ]
        },
        "بهارستان": {
            "بوستان": [
                "اسماعیل آباد",
                "نسیم شهر",
                "همدانك"
            ],
            "گلستان": [
                "صالح آباد",
                "صالحیه",
                "میمنت",
                "گلستان"
            ]
        },
        "تهران": {
            "آفتاب": [
                "آفتاب",
                "خلازیر"
            ],
            "كن": [
                "سولقان"
            ],
            "مركزی": [
                "تهران",
                "تهران 1",
                "تهران 10",
                "تهران 11",
                "تهران 12",
                "تهران 13",
                "تهران 14",
                "تهران 15",
                "تهران 16",
                "تهران 17",
                "تهران 18",
                "تهران 19",
                "تهران 2",
                "تهران 20",
                "تهران 21",
                "تهران 22",
                "تهران 3",
                "تهران 4",
                "تهران 5",
                "تهران 6",
                "تهران 7",
                "تهران 8",
                "تهران 9",
                "سیاهرود"
            ]
        },
        "دماوند": {
            "رودهن": [
                "آبعلی",
                "رودهن",
                "مهرآباد"
            ],
            "مركزی": [
                "آبسرد",
                "ابرشیوه",
                "تاررود",
                "جمع آبرود",
                "دماوند",
                "كیلان"
            ]
        },
        "رباط کریم": {
            "مركزی": [
                "امامزاده ابوطالب",
                "رباطكریم",
                "منجیل آباد",
                "نصیرشهر",
                "وهن آباد",
                "پرند"
            ]
        },
        "ری": {
            "خاوران": [
                "خاوران شرقی",
                "خاوران غربی",
                "قیام دشت"
            ],
            "فشاپویه": [
                "حسن آباد",
                "كلین"
            ],
            "قلعه نو": [
                "قلعه نو",
                "چاله طرخان"
            ],
            "كهریزك": [
                "باقرشهر",
                "كهریزك"
            ],
            "مركزی": [
                "ری",
                "عظیمیه",
                "غنی آباد"
            ]
        },
        "شمیرانات": {
            "رودبارقصران": [
                "تجریش",
                "رودبارقصران",
                "شمشک",
                "فشم"
            ],
            "لواسانات": [
                "لواسان",
                "لواسان بزرگ",
                "لواسان كوچك"
            ]
        },
        "شهریار": {
            "جوقین": [
                "جوقین",
                "فردوس",
                "فردوسیه",
                "وحیدیه"
            ],
            "مركزی": [
                "اندیشه",
                "باغستان",
                "رزكان",
                "سعیدآباد",
                "شاهدشهر",
                "شهریار",
                "شهریار1",
                "شهریار2",
                "شهریار3",
                "صباشهر",
                "قایم آباد",
                "مویز"
            ]
        },
        "فیروزكوه": {
            "ارجمند": [
                "ارجمند",
                "دوبلوك",
                "قزقانچای"
            ],
            "مركزی": [
                "حبلرود",
                "شهرآباد",
                "فیروزكوه",
                "پشتكوه"
            ]
        },
        "قدس": {
            "مركزی": [
                "دانش",
                "قدس",
                "هفت جوی"
            ]
        },
        "قرچک": {
            "مرکزی": [
                "قرچک",
                "قشلاق جیتو",
                "ولی آباد"
            ]
        },
        "ملارد": {
            "صفا دشت": [
                "اخترآباد",
                "بی بی سكینه",
                "صفادشت"
            ],
            "مركزی": [
                "ملارد",
                "ملارد جنوبی",
                "ملارد شمالی"
            ]
        },
        "ورامین": {
            "جوادآباد": [
                "بهنام عرب جنوبی",
                "بهنام وسطجنوبی",
                "جوادآباد"
            ],
            "مركزی": [
                "بهنام وسط شمالی",
                "بهنام پازوكی جنوبی",
                "ورامین"
            ]
        },
        "پاكدشت": {
            "شریف آباد": [
                "جمال آباد",
                "شریف آباد",
                "كریم آباد"
            ],
            "مركزی": [
                "حصارامیر",
                "فرون آباد",
                "فرون اباد",
                "فیلستان",
                "پاكدشت",
                "پاكدشت 1",
                "پاكدشت 2"
            ]
        },
        "پردیس": {
            "بومهن": [
                "بومهن",
                "طاهر آباد",
                "گلخندان"
            ],
            "جاجرود": [
                "جاجرود",
                "خسرواباد",
                "سعید آباد",
                "سعیداباد"
            ],
            "مرکزی": [
                "باغ کمش",
                "پردیس",
                "کرشت"
            ]
        },
        "پیشوا": {
            "جلیل آباد": [
                "جلیل آباد",
                "جلیل اباد",
                "طارند بالا"
            ],
            "مركزی": [
                "عسگریه",
                "پیشوا"
            ]
        }
    },
    "خراسان جنوبی": {
        "بشرویه": {
            "ارسک": [
                "ارسک",
                "رقه"
            ],
            "مركزی": [
                "بشرویه",
                "علی جمال",
                "كرند"
            ]
        },
        "بیرجند": {
            "مرکزی": [
                "القورات",
                "باقران",
                "بیرجند",
                "بیرجند1",
                "بیرجند2",
                "شاخن",
                "شاخنات",
                "فشارود",
                "كاهشنگ"
            ]
        },
        "خوسف": {
            "جلگه ماژان": [
                "براکوه",
                "جلگه ماژان",
                "قلعه زری",
                "ماژان"
            ],
            "مرکزی": [
                "خور",
                "خوسف"
            ]
        },
        "درمیان": {
            "قهستان": [
                "قهستان",
                "کوشکک"
            ],
            "مرکزی": [
                "اسدیه",
                "درمیان",
                "نوغاب"
            ],
            "میاندشت": [
                "فخررود",
                "میاندشت"
            ],
            "گزیك": [
                "طبس مسینا",
                "گزیك"
            ]
        },
        "زیرکوه": {
            "زهان": [
                "افین",
                "زهان"
            ],
            "شاسکوه": [
                "آبیز",
                "بهناباد",
                "شاسکوه"
            ],
            "مرکزی": [
                "حاجی آباد",
                "زیرکوه",
                "پترگان"
            ]
        },
        "سرایان": {
            "آیسک": [
                "آیسک",
                "سرایان",
                "مصعبی"
            ],
            "سه قلعه": [
                "دوكوهه",
                "سه قلعه"
            ]
        },
        "سربیشه": {
            "درح": [
                "درح",
                "لانو"
            ],
            "مرکزی": [
                "سربیشه",
                "غیناب",
                "مومن آباد"
            ],
            "مود": [
                "مود",
                "نهارجان"
            ]
        },
        "طبس": {
            "دستگردان": [
                "دستگردان",
                "عشق آباد",
                "كوه یخاب"
            ],
            "دیهوک": [
                "دیهوک",
                "كویر"
            ],
            "مرکزی": [
                "طبس",
                "منتظریه",
                "نخلستان",
                "پیرحاجات",
                "گلشن"
            ]
        },
        "فردوس": {
            "اسلامیه": [
                "اسلامیه",
                "باغستان",
                "برون"
            ],
            "مرکزی": [
                "حومه",
                "فردوس"
            ]
        },
        "قاینات": {
            "سده": [
                "آرین شهر",
                "آفریز",
                "سده",
                "پسكوه"
            ],
            "مرکزی": [
                "اسفدن",
                "قاین",
                "مهیار",
                "پیشكوه"
            ],
            "نیمبلوک": [
                "خضری دشت بیاض",
                "كرغند",
                "نیمبلوك",
                "نیمبلوک"
            ]
        },
        "نهبندان": {
            "سرداران": [
                "سهل آباد",
                "سیدال",
                "عربخانه"
            ],
            "شوسف": [
                "شوسف",
                "گرم تمام ده"
            ],
            "مرکزی": [
                "بندان",
                "میغان",
                "نه",
                "نهبندان"
            ]
        }
    },
    "خراسان رضوی": {
        "باخرز": {
            "بالا ولایت": [
                "اشتین",
                "بالاولایت",
                "قلعه نو علیا"
            ],
            "مرکزی": [
                "باخرز",
                "دشت ارزنه",
                "مالین"
            ]
        },
        "بجستان": {
            "مرکزی": [
                "بجستان",
                "جزین"
            ],
            "یونسی": [
                "سردق",
                "یونسی"
            ]
        },
        "بردسکن": {
            "anابد": [
                "انابد",
                "درونه",
                "صحرا"
            ],
            "شهرآباد": [
                "جلگه",
                "شهرآباد"
            ],
            "مرکزی": [
                "بردسکن",
                "کنارشهر",
                "کوهپایه"
            ]
        },
        "تایباد": {
            "مرکزی": [
                "تایباد",
                "پایین ولایت",
                "کاریز",
                "کرات"
            ],
            "میان ولایت": [
                "دشت تایباد",
                "مشهد ریزه",
                "کوهسنگی"
            ]
        },
        "تربت جام": {
            "بوژگان": [
                "احمدآباد صولت",
                "دشت جام",
                "نیل شهر",
                "هریرود"
            ],
            "مرکزی": [
                "تربت جام",
                "جامرود",
                "جلگه موسی آباد",
                "میان جام"
            ],
            "نصرآباد": [
                "بالاجام",
                "نصرآباد",
                "کاریزان"
            ],
            "پایین جام": [
                "زام",
                "سمیع آباد",
                "گل بانو"
            ]
        },
        "تربت حیدریه": {
            "بایک": [
                "بایک"
            ],
            "جلگه رخ": [
                "بالا رخ",
                "رباط سنگ",
                "میان رخ",
                "نسر",
                "پایین رخ"
            ],
            "مرکزی": [
                "بالا ولایت",
                "تربت حیدریه",
                "پایین ولایت"
            ],
            "کدکن": [
                "رقیچه",
                "کدکن"
            ]
        },
        "جغتای": {
            "مرکزی": [
                "جغتای",
                "دستوران"
            ],
            "هلالی": [
                "ریواده",
                "میان جوین",
                "پایین جوین"
            ]
        },
        "جوین": {
            "عطاملک": [
                "حکم آباد",
                "زرین"
            ],
            "مرکزی": [
                "بالاجوین",
                "نقاب",
                "پیراکوه"
            ]
        },
        "خلیل آباد": {
            "ششطراز": [
                "ششطراز",
                "کندر",
                "کویر"
            ],
            "مرکزی": [
                "حومه",
                "خلیل آباد",
                "رستاق"
            ]
        },
        "خواف": {
            "جلگه زوزن": [
                "زوزن",
                "قاسم آباد",
                "کیبر"
            ],
            "سلامی": [
                "بالا خواف",
                "سده",
                "سلامی"
            ],
            "سنگان": [
                "بستان",
                "سنگان",
                "پایین خواف"
            ],
            "مرکزی": [
                "خواف",
                "میان خواف",
                "نشتیفان"
            ]
        },
        "خوشاب": {
            "مرکزی": [
                "رباط جز",
                "سلطان آباد"
            ],
            "مشکان": [
                "مشکان",
                "یام"
            ],
            "نوده انقلاب": [
                "طبس",
                "نوده انقلاب"
            ]
        },
        "داورزن": {
            "باشتین": [
                "باشتین",
                "ریوند",
                "مهر"
            ],
            "مرکزی": [
                "داورزن",
                "مزینان",
                "کاه"
            ]
        },
        "درگز": {
            "لطف آباد": [
                "دیباج",
                "زنگلانلو",
                "لطف آباد"
            ],
            "مرکزی": [
                "تکاب",
                "درگز"
            ],
            "نوخندان": [
                "درونگر",
                "شهرستانه",
                "نوخندان"
            ],
            "چاپشلو": [
                "قره باشلو",
                "میانکوه",
                "چاپشلو"
            ]
        },
        "رشتخوار": {
            "جنگل": [
                "جنگل",
                "شعبه"
            ],
            "مرکزی": [
                "آستانه",
                "رشتخوار"
            ]
        },
        "زاوه": {
            "سلیمان": [
                "ساق",
                "سلیمان",
                "چخماق"
            ],
            "مرکزی": [
                "دولت آباد",
                "زاوه",
                "صفاییه"
            ]
        },
        "زبرخان": {
            "اسحاق آباد": [
                "اسحق آباد",
                "حشمتیه"
            ],
            "مرکزی": [
                "اردوغش",
                "خرو",
                "درود",
                "زبرخان",
                "قدمگاه"
            ]
        },
        "سبزوار": {
            "روداب": [
                "خواشد",
                "روداب",
                "فروغن",
                "کوه همایی"
            ],
            "مرکزی": [
                "رباط",
                "سبزوار",
                "سبزوار1",
                "سبزوار2",
                "قصبه شرقی",
                "قصبه غربی",
                "کراب"
            ]
        },
        "سرخس": {
            "مرزداران": [
                "مرز داران",
                "مزدآوند",
                "پل خاتون",
                "گل بی بی"
            ],
            "مرکزی": [
                "تجن",
                "خانگیران",
                "سرخس"
            ]
        },
        "ششتمد": {
            "شامکان": [
                "ربع شامات",
                "شامکان"
            ],
            "مرکزی": [
                "بیهق",
                "تکاب کوه میش",
                "ششتمد"
            ]
        },
        "صالح آباد": {
            "جنت آباد": [
                "استای",
                "جنت آباد"
            ],
            "مرکزی": [
                "باغ کشمیر",
                "صالح آباد",
                "قلعه حمام"
            ]
        },
        "طرقبه شاندیز": {
            "شاندیز": [
                "ابرده",
                "شاندیز"
            ],
            "طرقبه": [
                "جاغرق",
                "طرقبه"
            ]
        },
        "فریمان": {
            "قلندر آباد": [
                "سفید سنگ",
                "قلندر آباد"
            ],
            "مرکزی": [
                "بالابند",
                "سنگ بست",
                "فرهادگرد",
                "فریمان"
            ]
        },
        "فیروزه": {
            "طاغنکوه": [
                "طاغنکوه جنوبی",
                "طاغنکوه شمالی",
                "همت آباد",
                "گرماب"
            ],
            "مرکزی": [
                "تخت جلگه",
                "فیروزه"
            ]
        },
        "قوچان": {
            "آبکوه": [
                "آلماجق",
                "بهار",
                "دوغایی"
            ],
            "باجگیران": [
                "باجگیران",
                "دولتخانه"
            ],
            "قوچان عتیق": [
                "شهر کهنه",
                "قوچان عتیق",
                "یزدان"
            ],
            "مرکزی": [
                "سودلانه",
                "شیرین دره",
                "قوچان",
                "مزرج"
            ]
        },
        "مشهد": {
            "احمدآباد": [
                "سرجام",
                "ملک آباد",
                "پیوه ژن"
            ],
            "رضویه": [
                "آبروان",
                "رضویه",
                "میامی",
                "پایین ولایت"
            ],
            "مرکزی": [
                "تبادکان",
                "توس",
                "درز آب",
                "مشهد",
                "مشهد 1",
                "مشهد 10",
                "مشهد 11",
                "مشهد 12",
                "مشهد 2",
                "مشهد 3",
                "مشهد 4",
                "مشهد 5",
                "مشهد 6",
                "مشهد 7",
                "مشهد 8",
                "مشهد 9",
                "مشهد ثامن",
                "میان ولایت",
                "کارده",
                "کنویست"
            ]
        },
        "مه ولات": {
            "شادمهر": [
                "ازغند",
                "شادمهر",
                "مه ولات شمالی"
            ],
            "مرکزی": [
                "حومه",
                "فیض آباد",
                "مه ولات جنوبی"
            ]
        },
        "میان جلگه": {
            "بلهرات": [
                "بلهرات",
                "سالاری"
            ],
            "مرکزی": [
                "عشق آباد",
                "غزالی"
            ]
        },
        "نیشابور": {
            "سرولایت": [
                "برزنون",
                "سرولایت",
                "چکنه"
            ],
            "مرکزی": [
                "بار",
                "بینالود",
                "دربقاضی",
                "ریوند",
                "فضل",
                "مازول",
                "نیشابور",
                "نیشابور 1",
                "نیشابور 2"
            ]
        },
        "چناران": {
            "رادکان": [
                "رادکان",
                "غیاث آباد"
            ],
            "سید آباد": [
                "حکیم آباد",
                "سید آباد",
                "سیدآباد"
            ],
            "مرکزی": [
                "بقمج",
                "چناران"
            ]
        },
        "کاشمر": {
            "فرح دشت": [
                "رزق آباد",
                "فرگ قلعه",
                "قلعه بالا"
            ],
            "مرکزی": [
                "بالا ولایت",
                "پایین ولایت",
                "کاشمر"
            ]
        },
        "کلات": {
            "زاوین": [
                "زاوین",
                "شهر زو",
                "پساکوه",
                "چنار"
            ],
            "مرکزی": [
                "چرم",
                "کبود گنبد",
                "کلات"
            ],
            "هزار مسجد": [
                "حسن آباد",
                "لاین",
                "هزارمسجد"
            ]
        },
        "کوهسرخ": {
            "بررود": [
                "بررود",
                "تکاب"
            ],
            "مرکزی": [
                "برکوه",
                "ریوش",
                "کوه سفید"
            ]
        },
        "گلبهار": {
            "مرکزی": [
                "بیزکی",
                "نوبهار",
                "گلبهار"
            ],
            "گلمکان": [
                "چشمه سبز",
                "گلمکان"
            ]
        },
        "گناباد": {
            "مرکزی": [
                "بیدخت",
                "حومه گناباد",
                "روشناوند",
                "پس کلوت",
                "گناباد"
            ],
            "کاخک": [
                "زیبد",
                "کاخک"
            ]
        }
    },
    "خراسان شمالی": {
        "اسفراین": {
            "زرق آباد": [
                "دامن کوه",
                "زرق آباد"
            ],
            "مركزی": [
                "آذری",
                "اسفراین",
                "رویین",
                "میلانلو"
            ]
        },
        "بام و صفی آباد": {
            "بام": [
                "بام",
                "ساریگل"
            ],
            "مرکزی": [
                "دهنه شیرین",
                "صفی آباد"
            ]
        },
        "بجنورد": {
            "مركزی": [
                "آلاداغ",
                "باباامان",
                "بجنورد",
                "بجنورد1",
                "بجنورد2",
                "بدرانلو",
                "چناران شهر"
            ],
            "گرمخان": [
                "حصارگرمخان",
                "گرمخان",
                "گیفان"
            ]
        },
        "جاجرم": {
            "جلگه سنخواست": [
                "دربند",
                "سنخواست",
                "چهارده سنخواست"
            ],
            "جلگه شوقان": [
                "شوقان",
                "طبر"
            ],
            "مركزی": [
                "جاجرم",
                "میان دشت"
            ]
        },
        "راز و جرگلان": {
            "جرگلان": [
                "جرگلان",
                "حصارچه",
                "یکه سعود"
            ],
            "غلامان": [
                "راستقان",
                "غلامان"
            ],
            "مرکزی": [
                "باغلق",
                "راز"
            ]
        },
        "سملقان": {
            "سملقان": [
                "آلمه",
                "آوا",
                "قاضی"
            ],
            "مركزی": [
                "آشخانه",
                "جیرانسو",
                "حومه"
            ]
        },
        "شیروان": {
            "سرحد": [
                "تكمران",
                "جیرستان",
                "لوجلی"
            ],
            "قوشخانه": [
                "قوشخانه",
                "قوشخانه بالا",
                "قوشخانه پایین"
            ],
            "مركزی": [
                "حومه",
                "خانلق",
                "زوارم",
                "زیارت",
                "سیوكانلو",
                "شیروان",
                "گلیان"
            ]
        },
        "فاروج": {
            "خبوشان": [
                "تیتكانلو",
                "حصار"
            ],
            "مركزی": [
                "سنگر",
                "شاه جهان",
                "فاروج"
            ]
        },
        "مانه": {
            "شیرین سو": [
                "شیرین سو",
                "کهنه جلگه"
            ],
            "مرکزی": [
                "اترک",
                "عشق آباد",
                "پیش قلعه"
            ]
        },
        "گرمه": {
            "مركزی": [
                "ایور",
                "بالا دشت",
                "درق",
                "گرمه",
                "گلستان"
            ]
        }
    },
    "خوزستان": {
        "آبادان": {
            "اروندکنار": [
                "اروندکنار",
                "مینوبار",
                "نصار",
                "نوآباد"
            ],
            "مرکزی": [
                "آبادان",
                "آبادان 1",
                "آبادان 2",
                "آبادان 3",
                "بهمنشیرجنوبی",
                "بهمنشیرشمالی",
                "شلاهی",
                "چویبده"
            ]
        },
        "آغاجاری": {
            "جولکی": [
                "آب باران",
                "جولکی",
                "سرجولکی"
            ],
            "مرکزی": [
                "آغاجاری"
            ]
        },
        "امیدیه": {
            "جایزان": [
                "جایزان"
            ],
            "مرکزی": [
                "آسیاب",
                "امیدیه",
                "میانکوه",
                "چاه سالم"
            ]
        },
        "اندیمشک": {
            "الوارگرمسیری": [
                "بیدروبه",
                "حسینیه",
                "قیلاب",
                "مازو"
            ],
            "مرکزی": [
                "آزادی",
                "اندیمشک",
                "حومه",
                "چم گلک"
            ]
        },
        "اندیکا": {
            "آبژدان": [
                "آبژدان",
                "کوشک"
            ],
            "مرکزی": [
                "شلال دشتگل",
                "قلعه خواجه"
            ],
            "چلو": [
                "زاووت",
                "للر کتک",
                "چلو"
            ]
        },
        "اهواز": {
            "اسماعیلیه": [
                "اسماعیلیه جنوبی",
                "اسماعیلیه شمالی"
            ],
            "غیزانیه": [
                "غیزانیه",
                "مشرحات"
            ],
            "مرکزی": [
                "الهایی",
                "اهواز",
                "اهواز1",
                "اهواز2",
                "اهواز3",
                "اهواز4",
                "اهواز5",
                "اهواز6",
                "اهواز7",
                "اهواز8",
                "لامی"
            ]
        },
        "ایذه": {
            "سوسن": [
                "سوسن شرقی",
                "سوسن غربی"
            ],
            "مرکزی": [
                "ایذه",
                "حومه شرقی",
                "حومه غربی",
                "مرغا",
                "هلایجان",
                "پیان"
            ]
        },
        "باغ ملک": {
            "قلعه تل": [
                "بارانگرد",
                "قلعه تل"
            ],
            "مرکزی": [
                "باغ ملک",
                "رودزرد",
                "منگشت",
                "هپرو"
            ],
            "میداود": [
                "سرله",
                "میداود"
            ]
        },
        "باوی": {
            "مرکزی": [
                "عناقچه",
                "ملاثانی"
            ],
            "ویس": [
                "زرگان",
                "شیبان",
                "ویس"
            ]
        },
        "بندرماهشهر": {
            "بندرامام خمینی": [
                "بندرامام خمینی"
            ],
            "مرکزی": [
                "بندرماهشهر",
                "جراحی",
                "چمران"
            ]
        },
        "بهبهان": {
            "تشان": [
                "تشان",
                "تشان شرقی",
                "تشان غربی"
            ],
            "زیدون": [
                "درونک",
                "سردشت"
            ],
            "مرکزی": [
                "بهبهان",
                "حومه",
                "دودانگه",
                "منصوریه"
            ]
        },
        "حمیدیه": {
            "مرکزی": [
                "حمیدیه",
                "دهکده",
                "کرخه"
            ],
            "گمبوعه": [
                "جهاد",
                "طراح"
            ]
        },
        "خرمشهر": {
            "مرکزی": [
                "حومه شرقی",
                "حومه غربی",
                "خرمشهر",
                "غرب کارون",
                "مقاومت"
            ],
            "مینو": [
                "جزیره مینو",
                "مینوشهر"
            ]
        },
        "دزفول": {
            "سردشت": [
                "حمزه",
                "سالند",
                "سردشت",
                "ماهوربرنجی"
            ],
            "شهیون": [
                "احمدفداله",
                "امامزاده سیدمحمود",
                "دره کاید",
                "سیدولی الدین",
                "شهی",
                "شهیون"
            ],
            "مرکزی": [
                "دزفول",
                "دزفول  3",
                "دزفول 1",
                "دزفول 2",
                "سیاه منصور",
                "شمس آباد",
                "شهر امام",
                "صفی آباد",
                "قبله ای",
                "منتظران",
                "میانرود"
            ],
            "چغامیش": [
                "جندی شاپور",
                "خیبر",
                "چغامیش"
            ]
        },
        "دزپارت": {
            "قارون": [
                "دنباله رودجنوبی",
                "شیوند"
            ],
            "مرکزی": [
                "دنباله رودشمالی",
                "دهدز"
            ]
        },
        "دشت آزادگان": {
            "بستان": [
                "بستان",
                "سعیدیه"
            ],
            "مرکزی": [
                "ابوحمیظه",
                "الله اکبر",
                "حومه شرقی",
                "حومه غربی",
                "سوسنگرد",
                "کوت سیدنعیم"
            ]
        },
        "رامشیر": {
            "مرکزی": [
                "رامشیر",
                "عبدلیه شرقی",
                "عبدلیه غربی"
            ],
            "مشراگه": [
                "آزاده",
                "مشراگه"
            ]
        },
        "رامهرمز": {
            "ابولفارس": [
                "ابوالفارس",
                "باوج",
                "سه تلون"
            ],
            "رودزرد": [
                "جره",
                "رود زرد ماشین",
                "ماماتین"
            ],
            "سلطان آباد": [
                "رستم آباد",
                "سلطان آباد"
            ],
            "مرکزی": [
                "حومه شرقی",
                "حومه غربی",
                "رامهرمز"
            ]
        },
        "شادگان": {
            "خنافره": [
                "خنافره",
                "سالمی",
                "ناصری"
            ],
            "دارخوین": [
                "دارخوین",
                "دریسیه"
            ],
            "مرکزی": [
                "آبشار",
                "بوزی",
                "جفال",
                "حسینی",
                "شادگان"
            ]
        },
        "شوش": {
            "فتح المبین": [
                "سرخه",
                "فتح المبین",
                "چنانه"
            ],
            "مرکزی": [
                "بن معلی",
                "حر",
                "حسین آباد",
                "شوش"
            ]
        },
        "شوشتر": {
            "شعیبیه": [
                "شعیبیه شرقی",
                "شعیبیه غربی",
                "گوریه"
            ],
            "مرکزی": [
                "سردارآباد",
                "سرداران",
                "شرافت",
                "شهیدمدرس",
                "شوشتر"
            ],
            "میان آب": [
                "عرب حسن",
                "میان آب جنوبی",
                "میان آب شمالی"
            ]
        },
        "صیدون": {
            "علاء": [
                "رود زیر",
                "صیدون جنوبی"
            ],
            "مرکزی": [
                "صیدون",
                "صیدون شمالی",
                "واجل"
            ]
        },
        "لالی": {
            "حتی": [
                "تراز",
                "جاستون شهه",
                "حتی"
            ],
            "مرکزی": [
                "دشت لالی",
                "سادات",
                "لالی"
            ]
        },
        "مسجدسلیمان": {
            "عنبر": [
                "ذیلایی",
                "عنبر"
            ],
            "مرکزی": [
                "جهانگیری",
                "جهانگیری شمالی",
                "مسجدسلیمان",
                "مسجدسلیمان 1",
                "مسجدسلیمان 2"
            ],
            "گلگیر": [
                "تل بزان",
                "تمبی گلگیر",
                "گلگیر"
            ]
        },
        "هفتکل": {
            "رغیوه": [
                "رغیوه",
                "گزین"
            ],
            "مرکزی": [
                "حومه",
                "هفتگل"
            ]
        },
        "هندیجان": {
            "مرکزی": [
                "هندیجان",
                "هندیجان شرقی",
                "هندیجان غربی"
            ],
            "چم خلف عیسی": [
                "زهره",
                "سورین",
                "چم خلف عیسی"
            ]
        },
        "هویزه": {
            "مرکزی": [
                "هویزه",
                "هویزه جنوبی",
                "هویزه شمالی"
            ],
            "نیسان": [
                "بنی صالح",
                "رفیع",
                "نیسان"
            ]
        },
        "کارون": {
            "سویسه": [
                "سویسه",
                "موران"
            ],
            "مرکزی": [
                "قلعه چنعان",
                "کوت عبدالله",
                "کوت عبداله"
            ]
        },
        "کرخه": {
            "شاوور": [
                "شاوور",
                "کرخا"
            ],
            "مرکزی": [
                "آهودشت",
                "الوان",
                "سیدعباس"
            ]
        },
        "گتوند": {
            "عقیلی": [
                "ترکالکی",
                "سماله",
                "عقیلی جنوبی",
                "عقیلی شمالی"
            ],
            "مرکزی": [
                "جنت مکان",
                "صالح شهر",
                "کیارس",
                "گتوند"
            ]
        }
    },
    "زنجان": {
        "ابهر": {
            "مرکزی": [
                "ابهر",
                "ابهررود",
                "حومه",
                "درسجین",
                "دولت آباد",
                "صایین قلعه",
                "هیدج"
            ]
        },
        "ایجرود": {
            "حلب": [
                "ایجرودپایین",
                "حلب"
            ],
            "مرکزی": [
                "ایجرودبالا",
                "زرین آباد",
                "سعیدآباد",
                "گلابر"
            ]
        },
        "خدابنده": {
            "افشار": [
                "شیوانات",
                "قشلاقات افشار",
                "گرماب"
            ],
            "بزینه رود": [
                "بزینه رود",
                "زرین رود",
                "زرینه رود"
            ],
            "دو تپه": [
                "توپقره",
                "حومه"
            ],
            "سجاس رود": [
                "آق بلاغ",
                "سجاس",
                "سجاس رود"
            ],
            "مرکزی": [
                "خرارود",
                "سهرورد",
                "قیدار",
                "نوربهار",
                "کرسف"
            ]
        },
        "خرمدره": {
            "مرکزی": [
                "الوند",
                "خرمدره"
            ]
        },
        "زنجان": {
            "زنجانرود": [
                "زنجانرودپایین",
                "غنی بیگلو",
                "نیک پی",
                "چایپاره بالا",
                "چایپاره پایین"
            ],
            "قره پشتلو": [
                "ارمغانخانه",
                "سهرین",
                "قره پشتلوبالا",
                "قره پشتلوپایین"
            ],
            "مرکزی": [
                "بناب",
                "بوغداکندی",
                "تهم",
                "زنجان",
                "زنجان 1",
                "زنجان 2",
                "زنجان 3",
                "زنجان 4",
                "زنجانرودبالا",
                "قلتوق",
                "معجزات"
            ]
        },
        "سلطانیه": {
            "باغ حلی": [
                "قره بلاغ",
                "گوزل دره"
            ],
            "مرکزی": [
                "سلطانیه",
                "سنبل آباد"
            ]
        },
        "طارم": {
            "مرکزی": [
                "آب بر",
                "درام"
            ],
            "چورزق": [
                "دستجرده",
                "چورزق"
            ],
            "گیلوان": [
                "تشویر",
                "گیلوان"
            ]
        },
        "ماهنشان": {
            "انگوران": [
                "انگوران",
                "دندی",
                "قلعه جوق"
            ],
            "مرکزی": [
                "اوریاد",
                "قزل گچیلو",
                "ماه نشان"
            ]
        }
    },
    "سمنان": {
        "آرادان": {
            "مرکزی": [
                "آرادان",
                "حسین آباد کردها",
                "یاتری"
            ],
            "کهن آباد": [
                "فروان",
                "کهن آباد"
            ]
        },
        "دامغان": {
            "امیراباد": [
                "امیریه",
                "تویه دروار",
                "قهاب رستاق",
                "قهاب صرصر"
            ],
            "مركزی": [
                "حومه",
                "دامغان",
                "دامنكوه",
                "دیباج",
                "رودبار",
                "کلاته"
            ]
        },
        "سرخه": {
            "سرخه": [
                "سرخه",
                "لاسگرد",
                "هفدر"
            ]
        },
        "سمنان": {
            "مركزی": [
                "حومه",
                "سمنان"
            ]
        },
        "شاهرود": {
            "بسطام": [
                "بسطام",
                "خرقان",
                "كلاته خیج",
                "كلاته های غربی",
                "مجن"
            ],
            "بیارجمند": [
                "بیارجمند",
                "خوارتوران"
            ],
            "مركزی": [
                "حومه",
                "دهملا",
                "رودیان",
                "شاهرود",
                "طرود"
            ]
        },
        "گرمسار": {
            "ایوانكی": [
                "ایوانكی"
            ],
            "مركزی": [
                "حومه",
                "گرمسار",
                "لجران"
            ]
        },
        "مهدی شهر": {
            "شهمیرزاد": [
                "چاشم",
                "شهمیرزاد"
            ],
            "مركزی": [
                "درجزین",
                "حومه",
                "مهدیشهر"
            ]
        },
        "میامی": {
            "کالپوش": [
                "رضوان",
                "طلوبین",
                "نردین"
            ],
            "مرکزی": [
                "فرومد",
                "میامی",
                "کلاهه"
            ]
        }
    },
    "سیستان و بلوچستان": {
        "ایرانشهر": {
            "بزمان": [
                "آب رئیس",
                "بزمان"
            ],
            "دامن": [
                "آبادان",
                "دامن"
            ],
            "مرکزی": [
                "ابتر",
                "ایرانشهر",
                "بمپورشرقی",
                "حومه"
            ]
        },
        "بمپور": {
            "کلاگن": [
                "کلاگن"
            ],
            "مرکزی": [
                "بمپورشرقی",
                "بمپورغربی",
                "محمدان"
            ]
        },
        "خاش": {
            "ایرندگان": [
                "ایرندگان",
                "ده رئیس",
                "کهنوک"
            ],
            "مرکزی": [
                "اسماعیل آباد",
                "خاش",
                "سنگان",
                "کارواندر",
                "کوه سفید"
            ],
            "نوک آباد": [
                "اسکل آباد",
                "تفتان جنوبی",
                "گوهرکوه",
                "نازیل",
                "نوک آباد"
            ]
        },
        "دلگان": {
            "جلگه چاه هاشم": [
                "جلگه چاه هاشم",
                "چاه علی"
            ],
            "مرکزی": [
                "دلگان",
                "گنبد علوی",
                "هودیان"
            ]
        },
        "دشتیاری": {
            "باهوکلات": [
                "باهوکلات",
                "درگس"
            ],
            "مرکزی": [
                "نگور",
                "سندمیرثوبان"
            ]
        },
        "راسک": {
            "پارود": [
                "پارود",
                "مورتان"
            ],
            "پیشین": [
                "پیشین",
                "زردبن"
            ],
            "مرکزی": [
                "جکیگور",
                "راسک",
                "راسک و فیروزآباد"
            ]
        },
        "زابل": {
            "مرکزی": [
                "بنجار",
                "حیدرآباد",
                "زابل",
                "قائم آباد"
            ]
        },
        "زابلی": {
            "بیرم": [
                "بیرم",
                "توتان و مهمدان"
            ],
            "مرکزی": [
                "زابلی"
            ]
        },
        "زاهدان": {
            "کورین": [
                "شورو",
                "سرخون",
                "کورین"
            ],
            "مرکزی": [
                "زاهدان",
                "زاهدان 1",
                "زاهدان 2",
                "زاهدان 3",
                "چشمه زیارت",
                "حرمک"
            ],
            "نصرت آباد": [
                "دومک",
                "نصرت آباد"
            ]
        },
        "زرآباد": {
            "شرقی": [
                "اسماعیل چات",
                "زرآبادشرقی"
            ],
            "مرکزی": [
                "زرآباد",
                "زرآبادغربی"
            ]
        },
        "زهک": {
            "خمک": [
                "خمک",
                "گوری"
            ],
            "مرکزی": [
                "زهک"
            ]
        },
        "سراوان": {
            "بم پشت": [
                "بم پشت",
                "سیرکان",
                "کشتگان"
            ],
            "مرکزی": [
                "حومه",
                "سراوان",
                "گشت",
                "ناهوک"
            ]
        },
        "سرباز": {
            "مرکزی": [
                "سرباز",
                "سرباز کلات"
            ],
            "مینان": [
                "کزور",
                "مینان"
            ]
        },
        "سوران": {
            "زابلی": [
                "زابلی",
                "مرکزی"
            ],
            "مرکزی": [
                "سیب و سوران",
                "شندان"
            ],
            "هیدوچ": [
                "کنت",
                "هیدوچ"
            ]
        },
        "سیب و سوران": {
            "پسکوه": [
                "پسکوه",
                "سرسوره"
            ],
            "مرکزی": [
                "سیب و سوران",
                "شندان"
            ]
        },
        "فنوج": {
            "کتیج": [
                "کتیج",
                "محترم اباد"
            ],
            "مرکزی": [
                "فنوج",
                "مسکوتان"
            ]
        },
        "قصرقند": {
            "تلنگ": [
                "تلنگ",
                "شارک"
            ],
            "ساربوک": [
                "حمیری",
                "ساربوک"
            ],
            "مرکزی": [
                "قصرقند",
                "هلونچگان"
            ]
        },
        "مهرستان": {
            "آشار": [
                "آشار",
                "ایرافشان"
            ],
            "مرکزی": [
                "دهی",
                "مهرستان",
                "زابلی"
            ]
        },
        "میرجاوه": {
            "ریگ ملک": [
                "ریگ ملک",
                "تهلاب"
            ],
            "لادیز": [
                "تمین",
                "لادیز"
            ],
            "مرکزی": [
                "انده",
                "جون آباد",
                "میرجاوه"
            ]
        },
        "نیک شهر": {
            "بنت": [
                "بنت",
                "توتان و مهمدان",
                "دستگرد"
            ],
            "مرکزی": [
                "چاهان",
                "هیچان",
                "نیک شهر"
            ]
        },
        "نیمروز": {
            "صابری": [
                "قائم آباد",
                "گلخانی"
            ],
            "مرکزی": [
                "ادیمی",
                "بزی"
            ]
        },
        "هامون": {
            "تیمورآباد": [
                "تیمورآباد",
                "کوه خواجه"
            ],
            "مرکزی": [
                "لوتک",
                "محمدآباد"
            ]
        },
        "هیرمند": {
            "قرقری": [
                "قرقری",
                "اکبرآباد"
            ],
            "مرکزی": [
                "جهان آباد",
                "دوست محمد",
                "مارگان"
            ]
        },
        "چابهار": {
            "پلان": [
                "پلان",
                "تلنگ"
            ],
            "مرکزی": [
                "چابهار",
                "کمبل سلیمان"
            ]
        },
        "کنارک": {
            "کهیر": [
                "کهیر",
                "تنگ"
            ],
            "مرکزی": [
                "جهلیان",
                "بانسنت",
                "زرآباد",
                "کنارک"
            ]
        },
        "گلشن": {
            "کله گان": [
                "کله گان",
                "شنداشک"
            ],
            "مرکزی": [
                "جالق",
                "سینکان",
                "کوشه"
            ]
        }
    },
    "فارس": {
        "آباده": {
            "بهمن صغاد": [
                "بهمن",
                "خسروشیرین",
                "صغاد"
            ],
            "مرکزی": [
                "آباده",
                "ایزدخواست",
                "بیدک",
                "سورمق"
            ]
        },
        "ارسنجان": {
            "مرکزی": [
                "ارسنجان",
                "خبریز",
                "شورآب",
                "علی آباد ملک"
            ]
        },
        "استهبان": {
            "مرکزی": [
                "ایج",
                "استهبان"
            ],
            "رونیز": [
                "خیر",
                "رونیز"
            ]
        },
        "اقلید": {
            "حسن آباد": [
                "احمدآباد",
                "حسن آباد",
                "بکان"
            ],
            "سده": [
                "آسپاس",
                "سده",
                "دژکرد"
            ],
            "مرکزی": [
                "اقلید",
                "خنجشت",
                "شهرمیان"
            ]
        },
        "اوز": {
            "بیدشهر": [
                "بیدشهر",
                "قلات",
                "کوره"
            ],
            "مرکزی": [
                "اوز",
                "فیشور"
            ]
        },
        "بختگان": {
            "آباده طشک": [
                "آباده طشک",
                "بختگان",
                "حنا"
            ],
            "حنا": [
                "چاه گز"
            ]
        },
        "بوانات": {
            "سرچهان": [
                "باغ صفا",
                "سرچهان",
                "کره ای",
                "گودرز"
            ],
            "مرکزی": [
                "بوانات",
                "باغستان",
                "سیمکان",
                "مزایجان"
            ]
        },
        "بیضا": {
            "بانش": [
                "بانش",
                "هفت خان"
            ],
            "مرکزی": [
                "بیضا",
                "کوشک هزار"
            ]
        },
        "پاسارگاد": {
            "پاسارگاد": [
                "ابوالوردی",
                "سرپنیران",
                "مادرسلیمان"
            ],
            "مرکزی": [
                "سعادت شهر",
                "کمین"
            ]
        },
        "جهرم": {
            "سیمکان": [
                "پشت پر",
                "پل به بالا",
                "پل به پایین"
            ],
            "کردیان": [
                "قطب آباد",
                "علویه"
            ],
            "مرکزی": [
                "جهرم",
                "جهرم 1",
                "جهرم 2",
                "جلگاه",
                "کوهک"
            ]
        },
        "خرامه": {
            "مرکزی": [
                "خیرآباد",
                "خرامه",
                "کفدهک",
                "سلطان شهر"
            ]
        },
        "خرم بید": {
            "مشهد مرغاب": [
                "شهیدآباد",
                "مشهدمرغاب"
            ],
            "مرکزی": [
                "خرمی",
                "دهبید",
                "قشلاق",
                "صفاشهر"
            ]
        },
        "خفر": {
            "راهگان": [
                "راهگان",
                "راهگان شمالی"
            ],
            "مرکزی": [
                "خفر",
                "علی آباد",
                "سفیدان",
                "گل برنجی",
                "باب انار"
            ]
        },
        "خنج": {
            "محمله": [
                "باغان",
                "محمله"
            ],
            "مرکزی": [
                "تنگ نارک",
                "خنج",
                "سیف آباد"
            ]
        },
        "داراب": {
            "جنت": [
                "جنت",
                "شهرجنت",
                "قلمرو"
            ],
            "رستاق": [
                "رستاق",
                "کوهستان"
            ],
            "فورگ": [
                "آبشور",
                "دوبرجی",
                "فدامی"
            ],
            "مرکزی": [
                "بالش",
                "بختاجرد",
                "پاسخن",
                "داراب",
                "فسارود",
                "هشیوار"
            ]
        },
        "رستم": {
            "سورنا": [
                "پشتکوه رستم",
                "رستم سه"
            ],
            "مرکزی": [
                "رستم یک",
                "رستم دو",
                "مصیری"
            ]
        },
        "زرقان": {
            "رحمت آباد": [
                "رحمت آباد",
                "سرود"
            ],
            "مرکزی": [
                "بندامیر",
                "زرقان"
            ]
        },
        "زرین دشت": {
            "ایزدخواست": [
                "ایزدخواست شرقی",
                "ایزدخواست غربی"
            ],
            "مرکزی": [
                "حاجی آباد",
                "خسویه",
                "دبیران",
                "زیرآب",
                "شهرپیر"
            ]
        },
        "سپیدان": {
            "مرکزی": [
                "اردکان",
                "خفری",
                "کمهر"
            ],
            "همایجان": [
                "همایجان",
                "سرناب"
            ]
        },
        "سرچهان": {
            "باغ صفا": [
                "باغ صفا",
                "سرچهان"
            ],
            "مرکزی": [
                "حسامی",
                "کره ای",
                "توجردی"
            ]
        },
        "سروستان": {
            "کوهنجان": [
                "کوهنجان",
                "مهارلو"
            ],
            "مرکزی": [
                "سروستان",
                "شوریجه"
            ]
        },
        "شیراز": {
            "ارژن": [
                "خانه زنیان",
                "دشت ارژن",
                "قره چمن",
                "کوهمره سرخی"
            ],
            "مرکزی": [
                "بیدزرد",
                "داریان",
                "دراک",
                "سیاخ دارنگون",
                "شیراز",
                "شیراز 1",
                "شیراز 10",
                "شیراز 11",
                "شیراز 2",
                "شیراز 3",
                "شیراز 4",
                "شیراز 5",
                "شیراز 6",
                "شیراز 7",
                "شیراز 8",
                "شیراز 9",
                "قره باغ",
                "کفترک",
                "شهرصدرا"
            ]
        },
        "فراشبند": {
            "دهرم": [
                "دهرم",
                "دژگاه"
            ],
            "مرکزی": [
                "آویز",
                "فراشبند",
                "نوجین"
            ]
        },
        "فسا": {
            "ششده و قره بلاغ": [
                "ششده",
                "قره بلاغ"
            ],
            "شیبکوه": [
                "فدشکویه",
                "میانده"
            ],
            "مرکزی": [
                "جنگل",
                "صحرارود",
                "فسا",
                "کوشکقاضی",
                "زاهدشهر",
                "نوبندگان"
            ]
        },
        "فیروزآباد": {
            "میمند": [
                "خواجه ای",
                "دادنجان",
                "میمند",
                "پرزیتون"
            ],
            "مرکزی": [
                "احمدآباد",
                "جایدشت",
                "فیروزآباد"
            ]
        },
        "قیر و کارزین": {
            "افزر": [
                "افزر",
                "زاخرویه"
            ],
            "مرکزی": [
                "امام شهر",
                "قیر",
                "کارزین",
                "مبارک آباد",
                "هنگام"
            ]
        },
        "لامرد": {
            "اشکنان": [
                "اشکنان",
                "اهل",
                "کال"
            ],
            "چاه ورز": [
                "چاه ورز",
                "شیخ عامر"
            ],
            "مرکزی": [
                "حومه",
                "سیگار",
                "چاه کور",
                "لامرد"
            ]
        },
        "لارستان": {
            "اوز": [
                "اوز",
                "بیدشهر",
                "فیشور"
            ],
            "بنارویه": [
                "بنارویه",
                "ده فیش"
            ],
            "بیرم": [
                "بالاده",
                "بیرم"
            ],
            "جویم": [
                "جویم",
                "هرم"
            ],
            "صحرای باغ": [
                "صحرای باغ"
            ],
            "مرکزی": [
                "حومه",
                "درزوسایبان",
                "دهکویه",
                "لار",
                "لطیفی"
            ],
            "گراش": [
                "ارد",
                "فداغ",
                "گراش"
            ]
        },
        "مرودشت": {
            "درودزن": [
                "ابرج",
                "رامجرد دو",
                "درودزن"
            ],
            "سیدان": [
                "خفرک علیا",
                "رحمت"
            ],
            "کامفیروز": [
                "کامفیروزجنوبی",
                "کامفیروزشمالی"
            ],
            "کامفیروز جنوبی": [
                "کامفیروزجنوبی",
                "آب باد"
            ],
            "مرکزی": [
                "رامجرد یک",
                "رودبال",
                "کناره",
                "مرودشت",
                "مجدآباد",
                "نقش رستم"
            ]
        },
        "ممسنی": {
            "دشمن زیاری": [
                "دشمن زیاری",
                "مشایخ"
            ],
            "ماهورمیلاتی": [
                "ماهور",
                "میشان"
            ],
            "مرکزی": [
                "بکش یک",
                "بکش دو",
                "جاوید ماهوری",
                "فهلیان",
                "نورآباد",
                "خومه زار"
            ]
        },
        "مهر": {
            "اسیر": [
                "اسیر",
                "دشت لاله"
            ],
            "وراوی": [
                "وراوی",
                "خوزی"
            ],
            "گله دار": [
                "گله دار",
                "فال"
            ],
            "مرکزی": [
                "ارودان",
                "مهر"
            ]
        },
        "نی ریز": {
            "آباده طشک": [
                "آباده طشک",
                "بختگان"
            ],
            "پشتکوه": [
                "ده چاه",
                "مشکان"
            ],
            "قطرویه": [
                "ریزآب",
                "قطرویه"
            ],
            "مرکزی": [
                "هرگان",
                "نی ریز"
            ]
        },
        "کازرون": {
            "جره و بالاده": [
                "جره",
                "دادین",
                "فامور",
                "والاشهر"
            ],
            "خشت": [
                "امامزاده محمد",
                "خشت"
            ],
            "کمارج و کنارتخته": [
                "کنارتخته",
                "کمارج"
            ],
            "مرکزی": [
                "بلیان",
                "دریس",
                "شاپور",
                "کازرون",
                "انارستان"
            ],
            "چنارشاهیجان": [
                "انارستان",
                "چنارشاهیجان"
            ],
            "کوه مره": [
                "دیکانک",
                "کوه مره",
                "نودان"
            ]
        },
        "کوار": {
            "طسوج": [
                "طسوج",
                "فتح آباد"
            ],
            "مرکزی": [
                "فرمشکان",
                "کوار"
            ]
        },
        "گراش": {
            "ارد": [
                "ارد",
                "سبزپوش"
            ],
            "مرکزی": [
                "خلیلی",
                "فداغ",
                "گراش"
            ]
        }
    },
    "قزوین": {
        "آبیک": {
            "بشاریات": [
                "بشاریات شرقی",
                "بشاریات غربی",
                "خاکعلی"
            ],
            "مرکزی": [
                "آبیک",
                "زیاران",
                "کوهپایه غربی"
            ]
        },
        "آوج": {
            "آبگرم": [
                "آبگرم",
                "خرقان شرقی"
            ],
            "مرکزی": [
                "آوج",
                "حصارولیتیر",
                "خزقان غربی",
                "شهیدآباد"
            ]
        },
        "البرز": {
            "محمدیه": [
                "حصارخروان",
                "شریفیه",
                "محمدیه",
                "بیدستان"
            ],
            "مرکزی": [
                "الوند",
                "پیر یوسفیان",
                "نصرت آباد"
            ]
        },
        "بویین زهرا": {
            "دشتابی": [
                "دشتابی شرقی",
                "دشتابی غربی",
                "ارداق"
            ],
            "رامند": [
                "ابراهیم آباد",
                "رامندجنوبی",
                "دانشقهان"
            ],
            "شال": [
                "زین آباد",
                "قلعه هاشم",
                "شال"
            ],
            "مرکزی": [
                "بویین زهرا",
                "زهرای بالا",
                "زهرای پایین",
                "سگزآباد"
            ]
        },
        "تاکستان": {
            "اسفرورین": [
                "اک",
                "اسفرورین"
            ],
            "خرمدشت": [
                "افشاریه",
                "خرمدشت",
                "رامندشمالی"
            ],
            "ضیاآباد": [
                "دودانگه سفلی",
                "دودانگه علیا",
                "ضیاءآباد"
            ],
            "مرکزی": [
                "تاکستان",
                "قاقازان شرقی",
                "قاقازان غربی",
                "نرجه"
            ]
        },
        "قزوین": {
            "رودبار الموت شرقی": [
                "الموت بالا",
                "الموت پایین",
                "معلم کلایه"
            ],
            "رودبار الموت غربی": [
                "دستجرده",
                "رودبارشهرستان",
                "رودبارمحمدزمانی",
                "رازمیان"
            ],
            "کوهین": [
                "ایلات قاقازان شرقی",
                "ایلات قاقازان غربی",
                "کوهین"
            ],
            "مرکزی": [
                "اقبال شرقی",
                "اقبال غربی",
                "اقبالیه",
                "قزوین",
                "قزوین 1",
                "قزوین 2",
                "قزوین 3"
            ],
            "طارم سفلی": [
                "خندان",
                "کوهگیر",
                "نیارک",
                "چوقور",
                "سیردان"
            ]
        }
    },
    "قم": {
        "قم": {
            "جعفرآباد": [
                "جعفریه",
                "جعفرآباد"
            ],
            "خلجستان": [
                "دستجرد",
                "قاهان"
            ],
            "سلفچگان": [
                "راهجردشرقی",
                "سلفچگان",
                "نیزار"
            ],
            "مرکزی": [
                "قنوات",
                "قمرود",
                "قم"
            ],
            "کهک": [
                "فردو",
                "کهک",
                "کرمجگان"
            ]
        }
    },
    "کردستان": {
        "بانه": {
            "آرمرده": [
                "آرمرده",
                "پشت آربابا"
            ],
            "نمشیر": [
                "کانی سور",
                "نمشیر",
                "نمه شیر"
            ],
            "ننور": [
                "بوئین",
                "ننور"
            ],
            "مرکزی": [
                "بانه",
                "شوی"
            ]
        },
        "بیجار": {
            "چنگ الماس": [
                "بابارشانی",
                "پیرتاج",
                "خسروآباد"
            ],
            "کرانی": [
                "طغامین",
                "کرانی",
                "یاسوکند"
            ],
            "مرکزی": [
                "بیجار",
                "حومه",
                "سیاه منصور",
                "نجف آباد",
                "خورخوره",
                "توپ آغاج"
            ]
        },
        "دهگلان": {
            "بلبان آباد": [
                "ایلاق جنوبی",
                "سیس",
                "بلبان آباد"
            ],
            "مرکزی": [
                "ایلاق شمالی",
                "دهگلان",
                "حومه دهگلان",
                "قوری چای"
            ]
        },
        "دیواندره": {
            "سارال": [
                "سارال",
                "کول"
            ],
            "کرفتو": [
                "اوباتو",
                "زرینه",
                "کانی شیرین"
            ],
            "مرکزی": [
                "حومه",
                "چهل چشمه",
                "قرەتوره",
                "دیواندره"
            ]
        },
        "سروآباد": {
            "اورامان": [
                "اورامان تخت",
                "شالیار"
            ],
            "مرکزی": [
                "بیساران",
                "پایگلان",
                "دزلی",
                "رزآب",
                "ژریژه",
                "سروآباد",
                "کوسالان"
            ]
        },
        "سقز": {
            "امام": [
                "امام",
                "تیلکو"
            ],
            "زیویه": [
                "صاحب",
                "گل تپه",
                "خورخوره",
                "میرده"
            ],
            "سرشیو": [
                "چهل چشمه غربی",
                "سرشیو",
                "کومس"
            ],
            "مرکزی": [
                "ترجان",
                "تموغه",
                "سرا",
                "سقز",
                "سنته"
            ]
        },
        "سنندج": {
            "کلاترزان": [
                "ژاورودغربی",
                "کلاترزان",
                "نشور",
                "شوییشه"
            ],
            "مرکزی": [
                "آرندان",
                "آبیدر",
                "حومه",
                "سنندج",
                "سنندج 1",
                "سنندج 2",
                "سنندج 3",
                "نران",
                "سراب قامیش"
            ]
        },
        "قروه": {
            "سریش آباد": [
                "قصلان",
                "لکند",
                "سریش آباد"
            ],
            "چهاردولی": [
                "چهاردولی شرقی",
                "چهاردولی غربی",
                "دزج"
            ],
            "دلبران": [
                "مالوجه",
                "دلبران"
            ],
            "مرکزی": [
                "بدر",
                "پنجه علی جنوبی",
                "قروه"
            ]
        },
        "کامیاران": {
            "موچش": [
                "امیرآباد",
                "عوالان",
                "گاورد",
                "موچش"
            ],
            "مرکزی": [
                "بیلوار",
                "ژاورود",
                "شاهو",
                "کامیاران"
            ]
        },
        "مریوان": {
            "خاوومیرآباد": [
                "خاوومیرآباد",
                "برده رشه"
            ],
            "سرشیو": [
                "سرشیو",
                "گلچیدر",
                "چناره"
            ],
            "مرکزی": [
                "زریبار",
                "سرکل",
                "کومائین",
                "مریوان",
                "کانی دینار"
            ]
        }
    },
    "کرمان": {
        "ارزوییه": {
            "مرکزی": [
                "ارزوییه",
                "دهسرد",
                "صوغان"
            ]
        },
        "انار": {
            "مرکزی": [
                "انار",
                "بیاض",
                "حسین آباد"
            ]
        },
        "بافت": {
            "خبر": [
                "خبر",
                "دشتاب"
            ],
            "مرکزی": [
                "بافت",
                "بزنجان",
                "دهسرد",
                "فتح آباد",
                "کیسکان",
                "گوغر"
            ]
        },
        "بردسیر": {
            "لاله زار": [
                "قلعه عسگر",
                "لاله زار"
            ],
            "مرکزی": [
                "بردسیر",
                "دشتکار",
                "کوه پنج",
                "گلزار",
                "مشیز",
                "نگار"
            ]
        },
        "بم": {
            "بروات": [
                "بروات",
                "کرک و نارتیج"
            ],
            "مرکزی": [
                "بم",
                "حومه",
                "دریجان",
                "دهبکری",
                "کرک ونارتیج"
            ]
        },
        "جیرفت": {
            "اسماعیلی": [
                "اسماعیلی",
                "بلوک",
                "حسین آباد",
                "گنج آباد"
            ],
            "جبالبارز": [
                "جبالبارز",
                "رضوان",
                "سغدر",
                "مسکون"
            ],
            "ساردوییه": [
                "دلفارد",
                "ساردوییه",
                "گور"
            ],
            "مرکزی": [
                "اسلام آباد",
                "جیرفت",
                "خاتون آباد",
                "دولت آباد",
                "هلیل"
            ]
        },
        "رابر": {
            "هنزا": [
                "جواران",
                "هنزا"
            ],
            "مرکزی": [
                "رابر",
                "سیه بنوییه"
            ]
        },
        "راور": {
            "کوهساران": [
                "حرجند",
                "هجدک"
            ],
            "مرکزی": [
                "راور",
                "آبادیهای تابعه راور"
            ]
        },
        "رفسنجان": {
            "کشکوئیه": [
                "دره دران",
                "راویز",
                "شریف آباد",
                "کشکوئیه"
            ],
            "مرکزی": [
                "آزادگان",
                "اسلامیه",
                "خنامان",
                "دره داران",
                "رفسنجان",
                "رفسنجان 1",
                "رفسنجان 2",
                "رزم آوران",
                "سرچشمه",
                "فردوس",
                "قاسم آباد",
                "کبوترخان"
            ],
            "نوق": [
                "بهرمان",
                "رضوان",
                "جوادیه الهیه"
            ]
        },
        "رودبارجنوب": {
            "جازموریان": [
                "جازموریان",
                "کوهستان"
            ],
            "مرکزی": [
                "رودبار",
                "نهضت آباد"
            ]
        },
        "ریگان": {
            "رحمت آباد": [
                "رحمت",
                "سعدآباد"
            ],
            "مرکزی": [
                "ریگان",
                "گنبکی"
            ]
        },
        "زرند": {
            "مرکزی": [
                "اسلام آباد",
                "خانوک",
                "دشت خاک",
                "زرند",
                "ریحان",
                "محمدآباد",
                "وحدت",
                "یزدان آباد"
            ],
            "یزدان آباد": [
                "سیریز",
                "یزدان آباد"
            ]
        },
        "سیرجان": {
            "زیدآباد": [
                "زیدآباد",
                "محمودآبادسید"
            ],
            "پاریز": [
                "پاریز",
                "سعادت آباد"
            ],
            "گلستان": [
                "بلورد",
                "ملک آباد"
            ],
            "مرکزی": [
                "سیرجان",
                "شریف آباد",
                "نجف آباد",
                "نجف شهر"
            ]
        },
        "شهربابک": {
            "دهج": [
                "جوزم",
                "خبر",
                "دهج"
            ],
            "مرکزی": [
                "خاتون آباد",
                "خورسند",
                "شهربابک",
                "مدوارات",
                "مهرآباد",
                "پاقلعه"
            ]
        },
        "عنبرآباد": {
            "اسماعیلی": [
                "اسماعیلی",
                "حسین آباد",
                "گنج آباد"
            ],
            "جبالبارزجنوبی": [
                "امجز",
                "جبالبارزجنوبی",
                "حاجی آباد",
                "گرمسار",
                "مردهک",
                "نرگسان"
            ],
            "مرکزی": [
                "جهادآباد",
                "علی آباد",
                "عنبرآباد",
                "محمدآباد"
            ]
        },
        "فاریاب": {
            "حور": [
                "حور"
            ],
            "مرکزی": [
                "فاریاب",
                "گلاشکرد"
            ]
        },
        "فهرج": {
            "نگین کویر": [
                "چاهدگال",
                "نگین کویر"
            ],
            "مرکزی": [
                "برج اکرم",
                "فهرج"
            ]
        },
        "قلعه گنج": {
            "چاه دادخدا": [
                "چاه دادخدا",
                "رمشک",
                "مارز"
            ],
            "مرکزی": [
                "سرخ قلعه",
                "قلعه گنج"
            ]
        },
        "کرمان": {
            "راین": [
                "حسین آباد گروه",
                "راین"
            ],
            "شهداد": [
                "اندوهجرد",
                "تکاب",
                "سیرچ",
                "شهداد"
            ],
            "ماهان": [
                "ماهان",
                "قناتغستان"
            ],
            "مرکزی": [
                "اختیارآباد",
                "باغین",
                "درختنگان",
                "زنگی آباد",
                "سرآسیاب فرسنگی",
                "کرمان",
                "کرمان 1",
                "کرمان 2",
                "کرمان 3",
                "کرمان 4",
                "کرمان 5"
            ],
            "چترود": [
                "کوییرات",
                "معزآباد",
                "چترود"
            ]
        },
        "کوهبنان": {
            "طغرالجرد": [
                "پابدانا",
                "طغرالجرد"
            ],
            "مرکزی": [
                "جور",
                "خرمدشت",
                "کوهبنان"
            ]
        },
        "کهنوج": {
            "مرکزی": [
                "دهکهان",
                "کوتک",
                "مغان",
                "نخلستان",
                "کهنوج"
            ]
        },
        "منوجان": {
            "آسمینون": [
                "بجگان",
                "ده کهان",
                "نودژ"
            ],
            "مرکزی": [
                "قلعه",
                "منوجان",
                "نورآباد"
            ]
        },
        "نرماشیر": {
            "روداب": [
                "مومن آباد",
                "روداب شرقی",
                "روداب غربی"
            ],
            "مرکزی": [
                "پشت رود",
                "عزیزآباد",
                "نرماشیر"
            ]
        }
    },
    "کرمانشاه": {
        "اسلام آباد غرب": {
            "حمیل": [
                "حمیل",
                "منصوری",
                "هرسم"
            ],
            "مرکزی": [
                "اسلام آبادغرب",
                "حسن آباد",
                "حومه جنوبی",
                "حومه شمالی",
                "شیان"
            ]
        },
        "پاوه": {
            "باینگان": [
                "شیوسر",
                "ماکوان",
                "باینگان"
            ],
            "نودشه": [
                "سیروان",
                "نودشه"
            ],
            "نوسود": [
                "سیروان",
                "نوسود"
            ],
            "مرکزی": [
                "پاوه",
                "شمشیر",
                "هولی"
            ]
        },
        "ثلاث باباجانی": {
            "ازگله": [
                "ازگله",
                "جیگران",
                "سرقلعه"
            ],
            "مرکزی": [
                "تازه آباد",
                "خانه شور",
                "دولی دره",
                "زمکان"
            ]
        },
        "جوانرود": {
            "کلاشی": [
                "شروینه",
                "کلاشی"
            ],
            "مرکزی": [
                "بازان",
                "پلنگانه",
                "جوانرود"
            ]
        },
        "دالاهو": {
            "ریجاب": [
                "بان زرده",
                "ریجاب"
            ],
            "گهواره": [
                "قلخانی",
                "گوران",
                "گهواره"
            ],
            "مرکزی": [
                "بیونیج",
                "حومه",
                "کرند"
            ]
        },
        "روانسر": {
            "شاهو": [
                "منصورآقایی",
                "قوری قلعه"
            ],
            "مرکزی": [
                "بدر",
                "حسن آباد",
                "دولت آباد",
                "روانسر",
                "زالواب"
            ]
        },
        "سرپل ذهاب": {
            "مرکزی": [
                "بشیوه پاطاق",
                "پشت تنگ",
                "حومه سرپل",
                "دشت ذهاب",
                "قلعه شاهین",
                "سرپل ذهاب"
            ]
        },
        "سنقر": {
            "کلیایی": [
                "آگاهان",
                "سلیمانشاه",
                "سهنله",
                "کیونات"
            ],
            "مرکزی": [
                "آب باریک",
                "باوله",
                "سرآب",
                "سنقر",
                "گاودین",
                "پارسیان"
            ]
        },
        "صحنه": {
            "دینور": [
                "حر",
                "دینور",
                "کندوله",
                "میانراهان"
            ],
            "مرکزی": [
                "خدابنده لو",
                "صحنه",
                "گاماسیاب",
                "هجر"
            ]
        },
        "قصرشیرین": {
            "سومار": [
                "سومار"
            ],
            "مرکزی": [
                "الوند",
                "فتح آباد",
                "نصرآباد",
                "قصرشیرین"
            ]
        },
        "کرمانشاه": {
            "بیلوار": [
                "رازآور",
                "پشت دربند",
                "قلعه"
            ],
            "فیروزآباد": [
                "جلال وند",
                "سرفیروزآباد",
                "عثمانوند",
                "هلشی"
            ],
            "کوزران": [
                "سنجابی",
                "هفت آشیان",
                "کوزران"
            ],
            "ماهدشت": [
                "چقانرگس",
                "ماهدشت"
            ],
            "مرکزی": [
                "بالادربند",
                "دورودفرامان",
                "قره سو",
                "میان دربند",
                "کرمانشاه",
                "کرمانشاه 1",
                "کرمانشاه 2",
                "کرمانشاه 3",
                "کرمانشاه 4",
                "کرمانشاه 5",
                "کرمانشاه 6",
                "کرمانشاه 7",
                "کرمانشاه 8"
            ]
        },
        "کنگاور": {
            "مرکزی": [
                "خزل غربی",
                "فش",
                "کرماجان",
                "کنگاور",
                "گودین"
            ]
        },
        "گیلانغرب": {
            "گواور": [
                "حیدریه",
                "گواور",
                "سرمست"
            ],
            "مرکزی": [
                "چله",
                "حومه",
                "دیره",
                "ویژنان",
                "گیلانغرب"
            ]
        },
        "هرسین": {
            "بیستون": [
                "چهر",
                "شیرز",
                "چمچمال",
                "بیستون"
            ],
            "مرکزی": [
                "حومه",
                "هرسین"
            ]
        }
    },
    "کهگیلویه و بویراحمد": {
        "باشت": {
            "بوستان": [
                "بابویی",
                "بوستان"
            ],
            "مرکزی": [
                "کوه مره خامی",
                "باشت"
            ]
        },
        "بویراحمد": {
            "لوداب": [
                "لوداب",
                "چین"
            ],
            "مارگون": [
                "مارگون",
                "زیلایی"
            ],
            "مرکزی": [
                "دشت روم",
                "سررودجنوبی",
                "سررودشمالی",
                "کاکان",
                "یاسوج",
                "مادوان",
                "سپیدار"
            ]
        },
        "بهمئی": {
            "بهمئی گرمسیری": [
                "بهمئی گرمسیری جنوبی",
                "بهمئی گرمسیری شمالی",
                "لیکک"
            ],
            "مرکزی": [
                "بهمئی گرمسیری جنوبی",
                "کفش کنان"
            ]
        },
        "دنا": {
            "پاتاوه": [
                "پاتاوه",
                "سادات محمودی"
            ],
            "کبگیان": [
                "کبگیان",
                "چیتاب"
            ],
            "مرکزی": [
                "توت نده",
                "دنا",
                "سی سخت"
            ]
        },
        "کهگیلویه": {
            "دیشموک": [
                "آجم",
                "بهمئی سرحدی شرقی",
                "بهمئی سرحدی غربی",
                "دیشموک"
            ],
            "سوق": [
                "طیبی گرمسیری جنوبی",
                "راک",
                "سوق"
            ],
            "چاروسا": [
                "طیبی سرحدی شرقی",
                "طیبی سرحدی غربی",
                "قلعه رئیسی"
            ],
            "مرکزی": [
                "دهدشت شرقی",
                "دهدشت غربی",
                "دهدشت",
                "طیبی گرمسیری شمالی"
            ]
        },
        "گچساران": {
            "مرکزی": [
                "امامزاده جعفر",
                "بویراحمدگرمسیر",
                "بی بی حکیمه",
                "لشتر",
                "دوگنبدان"
            ]
        },
        "چرام": {
            "سرفاریاب": [
                "پشته ذیلایی",
                "sرفاریاب"
            ],
            "مرکزی": [
                "الگن",
                "چرام"
            ]
        },
        "لنده": {
            "موگرمون": [
                "شیتاب",
                "وحدت"
            ],
            "مرکزی": [
                "طیبی گرمسیری شمالی",
                "عالی طیب",
                "لنده"
            ]
        },
        "مارگون": {
            "زیلایی": [
                "زیلایی"
            ],
            "مرکزی": [
                "مارگون"
            ]
        }
    },
    "گلستان": {
        "آزادشهر": {
            "چشمه ساران": [
                "چشمه ساران",
                "خرمارودجنوبی",
                "نگین شهر"
            ],
            "مرکزی": [
                "آزادشهر",
                "نظام آباد"
            ]
        },
        "آق قلا": {
            "مرکزی": [
                "آق آلتین",
                "شیخ موسی",
                "گرگان بوی",
                "آق قلا"
            ],
            "وشمگیر": [
                "انبارالوم",
                "مززعه شمالی",
                "مزرعه جنوبی"
            ]
        },
        "بندرگز": {
            "نوکنده": [
                "بندرگزغربی",
                "لیوان",
                "نوکنده"
            ],
            "مرکزی": [
                "انزان شرقی",
                "انزان غربی",
                "بندرگز"
            ]
        },
        "ترکمن": {
            "سیجوال": [
                "قره سو شرقی"
            ],
            "مرکزی": [
                "جعفربای جنوبی",
                "بندرترکمن"
            ]
        },
        "رامیان": {
            "فندرسک": [
                "فندرسک جنوبی",
                "فندرسک شمالی",
                "خان ببین"
            ],
            "مرکزی": [
                "دلند",
                "رامیان",
                "قلعه میران",
                "تاتارعلیا"
            ]
        },
        "علی آباد": {
            "کمالان": [
                "استرآباد",
                "شیرنگ",
                "فاضل آباد"
            ],
            "مرکزی": [
                "زرین گل",
                "کتول",
                "علی آباد",
                "مزرعه"
            ]
        },
        "کردکوی": {
            "مرکزی": [
                "چهارکوه",
                "سدن رستاق شرقی",
                "سدن رستاق غربی",
                "کردکوی"
            ]
        },
        "کلاله": {
            "پیشکمر": [
                "عرب داغ",
                "زاوکوه"
            ],
            "مرکزی": [
                "آق سو",
                "تمران",
                "کنگور",
                "کلاله"
            ]
        },
        "گمیشان": {
            "گلدشت": [
                "جعفربای شرقی",
                "سیمین شهر"
            ],
            "مرکزی": [
                "جعفربای غربی",
                "نفتلیجه",
                "گمیش تپه"
            ]
        },
        "گنبدکاووس": {
            "داشلی برون": [
                "اترک",
                "کرند",
                "اینچه برون"
            ],
            "مرکزی": [
                "آق آباد",
                "باغلی ماراما",
                "سلطانعلی",
                "فجر",
                "گنبدکاووس"
            ]
        },
        "مراوه تپه": {
            "گلی داغ": [
                "گلی داغ",
                "شلمی"
            ],
            "مرکزی": [
                "مراوه تپه",
                "پالیزان"
            ]
        },
        "مینودشت": {
            "کوهسارات": [
                "گرو",
                "دوزین",
                "سرگل"
            ],
            "مرکزی": [
                "چهل چای",
                "قلعه قافه",
                "مینودشت"
            ]
        },
        "گرگان": {
            "بهاران": [
                "استرآبادشمالی",
                "قرق",
                "سرخنکلاته"
            ],
            "مرکزی": [
                "استرآبادجنوبی",
                "انجیرآب",
                "روشن آباد",
                "گرگان",
                "گرگان 1",
                "گرگان 2",
                "گرگان 3",
                "جلین"
            ]
        },
        "گالیکش": {
            "لوه": [
                "گلستان",
                "قراولان"
            ],
            "مرکزی": [
                "نیل کوه",
                "ینقاق",
                "گالیکش"
            ]
        }
    },
    "گیلان": {
        "آستارا": {
            "لوندویل": [
                "چلوند",
                "لوندویل"
            ],
            "مرکزی": [
                "آستارا",
                "ویرمونی"
            ]
        },
        "آستانه اشرفیه": {
            "کیاشهر": [
                "دهکا",
                "کیاشهر"
            ],
            "مرکزی": [
                "آستانه اشرفیه",
                "دهشال",
                "چهارده",
                "کورکاء"
            ]
        },
        "املش": {
            "رانکوه": [
                "رانکوه",
                "شبخوس لات",
                "کجید",
                "سمام"
            ],
            "مرکزی": [
                "املش جنوبی",
                "املش شمالی",
                "املش"
            ]
        },
        "بندرانزلی": {
            "مرکزی": [
                "چهارفریضه",
                "لیچارگی حسن رود",
                "بندرانزلی"
            ]
        },
        "تالش": {
            "اسالم": [
                "اسالم",
                "خاله سرا",
                "ناورود"
            ],
            "حویق": [
                "حویق",
                "چوبر",
                "شیرآباد"
            ],
            "کرگانرود": [
                "خطبه سرا",
                "لیسار",
                "طولارود"
            ],
            "مرکزی": [
                "ساحلی جوکندان",
                "تالش",
                "تولارود"
            ]
        },
        "رشت": {
            "خمام": [
                "جفرودبالا",
                "چوکام",
                "خمام"
            ],
            "خشکبیجار": [
                "حاجی بکنده",
                "نوشر",
                "خشکبیجار"
            ],
            "سنگر": [
                "اسلام آباد",
                "سراوان",
                "سنگر"
            ],
            "کوچصفهان": [
                "بلسبنه",
                "لشت نشاء",
                "کوچصفهان"
            ],
            "لشت نشاء": [
                "جیرهنده",
                "گفشه"
            ],
            "مرکزی": [
                "پسیخان",
                "حومه",
                "رشت",
                "رشت 1",
                "رشت 2",
                "رشت 3",
                "رشت 4",
                "رشت 5",
                "لاکان",
                "پیربازار"
            ]
        },
        "رضوانشهر": {
            "پره سر": [
                "دینাচال",
                "یلاق ارده",
                "پره سر"
            ],
            "مرکزی": [
                "خوشابر",
                "گیل دولاب",
                "رضوانشهر"
            ]
        },
        "رودبار": {
            "رحمت آباد و بلوکات": [
                "بلوکات",
                "دشتویل",
                "رحمت آباد",
                "توتکابن"
            ],
            "خورگام": [
                "خورگام",
                "دلفک",
                "بره سر"
            ],
            "عمارلو": [
                "جیرنده",
                "کلیشم"
            ],
            "مرکزی": [
                "رستم آبادجنوبی",
                "رستم آبادشمالی",
                "رودبار",
                "کلشتر",
                "لوشان",
                "منجیل"
            ]
        },
        "رودسر": {
            "رحیم آباد": [
                "اشکورات سفلی",
                "اشکورات علیا و سیارستاق ییلاقی",
                "رحیم آباد",
                "شوییل"
            ],
            "کلاچای": [
                "بی بالان",
                "کلاچای",
                "ماچیان",
                "واجارگاه"
            ],
            "مرکزی": [
                "چینی جان",
                "رضامحله",
                "رودسر"
            ],
            "چابکسر": [
                "اوشیان",
                "چابکسر",
                "سیاهکلرود"
            ]
        },
        "سیاهکل": {
            "دیلمان": [
                "پیرکوه",
                "دیلمان"
            ],
            "مرکزی": [
                "توتکی",
                "خرارود",
                "مالفجان",
                "سیاهکل"
            ]
        },
        "شفت": {
            "احمدسرگوراب": [
                "احمدسرگوراب",
                "چوبر"
            ],
            "مرکزی": [
                "جیرده",
                "ملاسرا",
                "شفت"
            ]
        },
        "صومعه سرا": {
            "تولم": [
                "تولم",
                "هندخاله",
                "مرجغل"
            ],
            "میرزاکوچک جنگلی": [
                "گوراب زرمیخ",
                "مرکیه"
            ],
            "مرکزی": [
                "طاهرگوراب",
                "ضیابر",
                "صومعه سرا"
            ]
        },
        "فومن": {
            "سردارجنگل": [
                "آلیان",
                "سردارجنگل",
                "ماکلوان"
            ],
            "مرکزی": [
                "رودپیش",
                "فومن",
                "گشت",
                "گوراب پس",
                "لوندویل"
            ]
        },
        "لاهیجان": {
            "رودبنه": [
                "رودبنه",
                "شیرجوپشت"
            ],
            "مرکزی": [
                "آهندان",
                "بازکیاگوراب",
                "لاهیجان",
                "لیالستان",
                "لیل"
            ]
        },
        "لنگرود": {
            "اطاقور": [
                "اطاقور",
                "لات لیل"
            ],
            "کومله": [
                "دریاسر",
                "مریدان",
                "کومله"
            ],
            "مرکزی": [
                "چاف",
                "دیوشل",
                "گل سفید",
                "لنگرود"
            ]
        },
        "ماسال": {
            "شاندرمن": [
                "شاندرمن",
                "شیخ نشین"
            ],
            "مرکزی": [
                "حومه",
                "ماسال"
            ]
        },
        "خمام": {
            "چوکام": [
                "اشمنانطالم",
                "فرشکی",
                "چوکام"
            ],
            "مرکزی": [
                "جفرودبالا",
                "چاپارخانه",
                "خمام"
            ]
        }
    },
    "لرستان": {
        "ازنا": {
            "جاپلق": [
                "جاپلق شرقی",
                "جاپلق غربی",
                "مومن آباد"
            ],
            "مرکزی": [
                "پاچه لک غربی",
                "سیلاخورشرقی",
                "ازنا"
            ]
        },
        "الیگودرز": {
            "بربرودشرقی": [
                "بربرودشرقی",
                "فرسش"
            ],
            "بربرودغربی": [
                "بربرودغربی",
                "چشمه پر"
            ],
            "ذلقی": [
                "پیشکوه ذلقی",
                "ذلقی شرقی",
                "ذلقی غربی"
            ],
            "مرکزی": [
                "الیگودرز",
                "پاچه لک شرقی",
                "خمه",
                "برم"
            ]
        },
        "اندیمشک": {
            "الوارگرمسیری": [
                "قیلاب",
                "مازو"
            ],
            "مرکزی": [
                "حومه",
                "چم گلک"
            ]
        },
        "بروجرد": {
            "اشترینان": [
                "اشترینان",
                "بردسره",
                "گودرزی"
            ],
            "مرکزی": [
                "بروجرد",
                "بروجرد 1",
                "بروجرد 2",
                "بردسره",
                "دره صیدی",
                "شیروان",
                "همت آباد",
                "والانجرد"
            ]
        },
        "پل دختر": {
            "مرکزی": [
                "جلوگیر",
                "جایدر",
                "ملاوی",
                "میانکوه غربی",
                "پلدختر"
            ],
            "معمولان": [
                "افرینه",
                "معمولان",
                "میانکوه شرقی"
            ]
        },
        "خرم آباد": {
            "پاپی": [
                "چم سنگر",
                "سپیددشت",
                "کشور",
                "گازه"
            ],
            "بیرانوند": [
                "بیرانوندجنوبی",
                "بیرانوندشمالی",
                "بیرانشهر"
            ],
            "زاغه": [
                "رازان",
                "زاغه",
                "قایدرحمت"
            ],
            "مرکزی": [
                "ازنا",
                "ده پیر",
                "ده پیرشمالی",
                "رباط",
                "کرگاه شرقی",
                "کرگاه غربی",
                "خرم آباد",
                "خرم آباد 1",
                "خرم آباد 2",
                "خرم آباد 3"
            ],
            "چغلوندی": [
                "بیرانوندجنوبی",
                "بیرانوندشمالی",
                "چغلوندی"
            ]
        },
        "دلفان": {
            "کاکاوند": [
                "ایتیوندجنوبی",
                "ایتیوندشمالی",
                "کاکاوندشرقی",
                "کاکاوندغربی",
                "هفت چشمه"
            ],
            "مرکزی": [
                "خاوه جنوبی",
                "خاوه شمالی",
                "میراحمدی جنوبی",
                "نورعلی",
                "نورآباد"
            ]
        },
        "دورود": {
            "سیلاخور": [
                "چالانچولان",
                "سیلاخور"
            ],
            "مرکزی": [
                "دورود",
                "ژان",
                "حشمت آباد"
            ]
        },
        "رومشکان": {
            "سوری": [
                "رومشکان شرقی",
                "سوری"
            ],
            "مرکزی": [
                "رومشکان",
                "بازوند",
                "چقابل"
            ]
        },
        "سلسله": {
            "فیروزآباد": [
                "فیروزآباد",
                "قلائی"
            ],
            "مرکزی": [
                "دوه سر",
                "قلعه مظفری",
                "هنام",
                "یوسف وند",
                "الشتر"
            ]
        },
        "کوهدشت": {
            "درب گنبد": [
                "بلوران",
                "درب گنبد"
            ],
            "طرهان": [
                "طرهان شرقی",
                "طرهان غربی",
                "گراب"
            ],
            "کوهنانی": [
                "کوهنانی",
                "زیرتنگ"
            ],
            "مرکزی": [
                "کوهدشت جنوبی",
                "کوهدشت شمالی",
                "گل گل",
                "کوهدشت"
            ]
        },
        "چگنی": {
            "شاهیوند": [
                "کشکان جنوبی",
                "کشکان شمالی"
            ],
            "ویسیان": [
                "شوراب",
                "ویسیان",
                "چمشک"
            ],
            "مرکزی": [
                "تشکن",
                "دوره",
                "سراب"
            ]
        }
    },
    "مازندران": {
        "آمل": {
            "امامزاده عبدالله": [
                "امامزاده عبدالله",
                "بالاخیابان لیتکوه"
            ],
            "دابودشت": [
                "دابوی جنوبی",
                "دابوی میانی",
                "دابودشت"
            ],
            "دشت سر": [
                "دشت سرشرقی",
                "دشت سرغربی",
                "دابودشت"
            ],
            "لاریجان": [
                "بالالاریجان",
                "لاریجان سفلی",
                "رینه",
                "گزنک"
            ],
            "مرکزی": [
                "آمل",
                "پایین خیابان لیتکوه",
                "چلاو",
                "هرازپی جنوبی"
            ]
        },
        "بابل": {
            "امیرکلا": [
                "امیرکلا"
            ],
            "بابل کنار": [
                "بابل کنار",
                "درازکلا",
                "مرزیکلا"
            ],
            "بندپی شرقی": [
                "سجادرود",
                "فیروزجاه",
                "گلیا"
            ],
            "بندپی غربی": [
                "خوش رود",
                "شهیدآباد",
                "خشرودپی"
            ],
            "لاله آباد": [
                "زرگرشهر",
                "کاری پی",
                "لاله آباد"
            ],
            "گتاب": [
                "گتاب جنوبی",
                "گتاب شمالی",
                "گتاب"
            ],
            "مرکزی": [
                "اسبوکلا",
                "بابل",
                "بابل 1",
                "بابل 2",
                "فیضیه",
                "گنج افروز"
            ]
        },
        "بابلسر": {
            "بهنمیر": [
                "بهنمیر",
                "عزیزک"
            ],
            "رودبست": [
                "پازوار",
                "رودبست"
            ],
            "مرکزی": [
                "بابلرود",
                "ساحلی",
                "بابلسر"
            ]
        },
        "بهشهر": {
            "مرکزی": [
                "بهشهر",
                "پنج هزاره",
                "میان کاله",
                "کوهستان",
                "خلیل شهر",
                "رستمکلا"
            ],
            "یانسر": [
                "اشرف",
                "شهدای یانه سر",
                "عشرستاق"
            ]
        },
        "تنکابن": {
            "خرم آباد": [
                "بلده",
                "خرم آباد",
                "دو هزار",
                "سه هزار",
                "شیرود"
            ],
            "نشتا": [
                "تمشکل",
                "کترا",
                "نشتارود"
            ],
            "مرکزی": [
                "گلیجان",
                "میرشمس الدین",
                "تنکابن"
            ]
        },
        "جویبار": {
            "گیل خوران": [
                "چپکرود",
                "لاریم"
            ],
            "مرکزی": [
                "حسن رضا",
                "سیاهرود",
                "جویبار",
                "کوهی خیل"
            ]
        },
        "چالوس": {
            "مرکزی": [
                "کلارستاق شرقی",
                "کلارستاق غربی",
                "چالوس",
                "هچیرود"
            ],
            "مرزن آباد": [
                "بیرون بشم",
                "کوهستان",
                "مرزن آباد"
            ]
        },
        "کلاردشت": {
            "مرکزی": [
                "کلاردشت",
                "بیرون بشم شرقی",
                "بیرون بشم غربی"
            ]
        },
        "رامسر": {
            "مرکزی": [
                "اشکور",
                "جنت رودبار",
                "رامسر",
                "سخت سر",
                "کتالم و سادات شهر"
            ]
        },
        "ساری": {
            "رودپی": [
                "رودپی شرقی",
                "رودپی غربی"
            ],
            "رودپی شمالی": [
                "فرح آبادشمالی",
                "فرح آبادجنوبی"
            ],
            "کلیجان رستاق": [
                "کلیجان رستاق سفلی",
                "کلیجان رستاق علیا",
                "هولار"
            ],
            "چهاردانگه": [
                "پشتکوه",
                "چهاردانگه",
                "گرماب",
                "کیاسر"
            ],
            "دودانگه": [
                "بنافت",
                "فریم"
            ],
            "مرکزی": [
                "اسفیوردشوراب",
                "ساری",
                "ساری 1",
                "ساری 2",
                "ساری 3",
                "مذکوره",
                "میاندورودکوچک"
            ]
        },
        "سوادکوه": {
            "زیرآب": [
                "سرخکلا",
                "کسلیان",
                "زیراب"
            ],
            "مرکزی": [
                "راستوپی",
                "ولوپی",
                "پل سفید",
                "آلاشت"
            ]
        },
        "سوادکوه شمالی": {
            "نارنجستان": [
                "چایباغ",
                "هتکه"
            ],
            "مرکزی": [
                "شرق و غرب شیرگاه",
                "لفور",
                "شیرگاه"
            ]
        },
        "سیمرغ": {
            "تالارپی": [
                "تالارپی",
                "طور"
            ],
            "مرکزی": [
                "دشت کنار",
                "کیاکلا"
            ]
        },
        "عباس آباد": {
            "سلمانشهر": [
                "کلارآباد",
                "سلمان شهر"
            ],
            "کلار": [
                "کلارشرقی",
                "کلارغربی"
            ],
            "مرکزی": [
                "لنگارودشرقی",
                "لنگارودغربی",
                "عباس آباد"
            ]
        },
        "فریدونکنار": {
            "دهفری": [
                "امامزاده عبدالله",
                "دهفری"
            ],
            "مرکزی": [
                "باریک رودجنوبی",
                "باریک رودشمالی",
                "فریدونکنار"
            ]
        },
        "قائم شهر": {
            "مرکزی": [
                "بالاتجن",
                "بیشع سر",
                "علی آباد",
                "قائم شهر",
                "قائم شهر1",
                "قائم شهر2",
                "کوهساران",
                "نوفن",
                "ارطه"
            ]
        },
        "محمودآباد": {
            "سرخ رود": [
                "دابوی شمالی",
                "هرازپی شمالی",
                "سرخ رود"
            ],
            "مرکزی": [
                "اهلمرستاق جنوبی",
                "اهلمرستاق شمالی",
                "محمودآباد"
            ]
        },
        "میاندورود": {
            "گهرباران": [
                "گهرباران جنوبی",
                "گهرباران شمالی"
            ],
            "مرکزی": [
                "کوهدشت شرقی",
                "کوهدشت غربی",
                "سورک"
            ]
        },
        "نکا": {
            "هزارجریب": [
                "استخرپشت",
                "زارم رود"
            ],
            "مرکزی": [
                "پی رجه",
                "قره طغان",
                "نکا"
            ]
        },
        "نور": {
            "بلده": [
                "اوزرود",
                "تتارستاق",
                "شیخ فضل اله نوری",
                "بلده"
            ],
            "چمستان": [
                "لاویج",
                "ناتل رستاق",
                "میانرود",
                "چمستان"
            ],
            "مرکزی": [
                "ناتل کنار سفلی",
                "ناتل کنار علیا",
                "میانبند",
                "نور",
                "ایزدشهر",
                "رویان"
            ]
        },
        "نوشهر": {
            "کجور": [
                "پنجک رستاق",
                "توابع کجور",
                "زبندرود",
                "پول",
                "کجور"
            ],
            "مرکزی": [
                "بلده کجور",
                "خیرودکنار",
                "کالج",
                "نوشهر"
            ]
        },
        "گلوگاه": {
            "کلباد": [
                "کلبادشرقی",
                "کلبادغربی"
            ],
            "مرکزی": [
                "توسکاچشمه",
                "آزادگان",
                "گلوگاه"
            ]
        }
    },
    "مرکزی": {
        "آشتیان": {
            "مرکزی": [
                "آشتیان",
                "سیاوشان",
                "گرکان",
                "مزرعه نو"
            ]
        },
        "اراک": {
            "ساروق": [
                "ساروق",
                "مشک آباد",
                "کرهرود"
            ],
            "معصومیه": [
                "مرزیجران",
                "معصومیه",
                "کارچان"
            ],
            "مرکزی": [
                "امان آباد",
                "اراک",
                "اراک 1",
                "اراک 2",
                "اراک 3",
                "اراک 4",
                "اراک 5",
                "داودآباد",
                "سده",
                "شمس آباد",
                "میчан"
            ]
        },
        "تفرش": {
            "مرکزی": [
                "بازرجان",
                "تفرش",
                "خرازان",
                "کوه پناه"
            ]
        },
        "خمین": {
            "کمره": [
                "خرمدشت",
                "چهارچشمه"
            ],
            "مرکزی": [
                "آشناخور",
                "خمین",
                "حمزه لو",
                "دهنو",
                "صالحان",
                "گله زن",
                "قورچی باشی"
            ]
        },
        "خنداب": {
            "قره چای": [
                "ارچل شرقی",
                "جاورسیان",
                "سنگ سفید"
            ],
            "مرکزی": [
                "اناج",
                "خنداب",
                "دهچال"
            ]
        },
        "دلیجان": {
            "مرکزی": [
                "دودهک",
                "هستیجان",
                "جاسب",
                "دلیجان",
                "نراق"
            ]
        },
        "زرندیه": {
            "خرقان": [
                "دوزج",
                "زرند",
                "علیا"
            ],
            "مرکزی": [
                "خشکرود",
                "حکیم آباد",
                "رودشور",
                "زاویه",
                "مامونیه",
                "پرندک",
                "رازقان"
            ]
        },
        "ساوه": {
            "نوبران": [
                "آق کهریز",
                "بیات",
                "کوهپایه",
                "نوبران",
                "غرق آباد"
            ],
            "مرکزی": [
                "ساوه",
                "شاهسونکندی",
                "طرازناهید",
                "قره چای",
                "نورعلی بیک"
            ]
        },
        "شازند": {
            "سربند": [
                "هندودر",
                "حاصلدر",
                "مالمیر"
            ],
            "قره کهریز": [
                "آستانه",
                "قره کهریز",
                "کوهسار",
                "سورانه"
            ],
            "مرکزی": [
                "آستانه",
                "ازنا",
                "پل دوآب",
                "زالیان",
                "شازند",
                "قره کهریز",
                "مهاجران"
            ],
            "زالیان": [
                "پل دوآب",
                "زالیان",
                "نهرمیان"
            ]
        },
        "فراهان": {
            "خنجین": [
                "خنجین",
                "تلخاب"
            ],
            "مرکزی": [
                "فرمهین",
                "ساروق",
                "فشک"
            ]
        },
        "کمیجان": {
            "میلاجرد": [
                "خسروبیک",
                "میلاجرد"
            ],
            "مرکزی": [
                "اسفندان",
                "کمیجان",
                "خرقان",
                "وفس"
            ]
        },
        "محلات": {
            "مرکزی": [
                "محلات",
                "باگرآباد",
                "خورهه",
                "نیم ور"
            ]
        }
    },
    "هرمزگان": {
        "ابوموسی": {
            "تنب": [
                "تنب"
            ],
            "مرکزی": [
                "سیری",
                "ابوموسی"
            ]
        },
        "بستک": {
            "جناح": [
                "جناح",
                "فرامرزان",
                "هرنگ",
                "کوخرد"
            ],
            "مرکزی": [
                "بستک",
                "دهنگ",
                "گوده",
                "فتویه"
            ]
        },
        "بشاگرد": {
            "جکدان": [
                "جکدان",
                "درابسر"
            ],
            "گوهران": [
                "گوهران",
                "گوهران"
            ],
            "مرکزی": [
                "سردشت",
                "پارمون"
            ]
        },
        "بندرعباس": {
            "تخت": [
                "تخت",
                "شمیل"
            ],
            "قلعه قاضی": [
                "قلعه قاضی",
                "سرخون"
            ],
            "فین": [
                "سیاهو",
                "فین",
                "گهره"
            ],
            "مرکزی": [
                "تازیان",
                "گچین",
                "بندرعباس",
                "بندرعباس 1",
                "بندرعباس 2",
                "بندرعباس 3",
                "ایسین"
            ]
        },
        "بندرلنگه": {
            "کیش": [
                "کیش",
                "لاوان"
            ],
            "مهران": [
                "دژگان",
                "مهران"
            ],
            "مرکزی": [
                "بندرلنگه",
                "مغویه",
                "حومه",
                "کنگ"
            ]
        },
        "پارسیان": {
            "دشتی": [
                "دشتی",
                "کوشکنار"
            ],
            "کوشکنار": [
                "بهدشت",
                "کوشکنار"
            ],
            "مرکزی": [
                "پارسیان",
                "مهرگان"
            ]
        },
        "جاسک": {
            "لیردف": [
                "پی وشک",
                "سورک"
            ],
            "مرکزی": [
                "جاسک",
                "جاسک کهنه",
                "کنگان",
                "گابریک"
            ]
        },
        "حاجی آباد": {
            "احمدی": [
                "احمدی",
                "کوهشاه"
            ],
            "فارغان": [
                "آشکارا",
                "فارغان"
            ],
            "مرکزی": [
                "حاجی آباد",
                "درآگاه",
                "طارم",
                "سرگز"
            ]
        },
        "خمیر": {
            "رویدر": [
                "رویدر",
                "رودبار"
            ],
            "مرکزی": [
                "خمیر",
                "کهورستان",
                "بندرپل"
            ]
        },
        "رودان": {
            "بیکاه": [
                "اسلام آباد",
                "بیکاه"
            ],
            "جغین": [
                "جغین جنوبی",
                "جغین شمالی"
            ],
            "رودخانه": [
                "رودخانه",
                "رودخانه بر",
                "مسافرآباد"
            ],
            "مرکزی": [
                "رودان",
                "فاریاب",
                "آبنما"
            ]
        },
        "سیریک": {
            "بمانی": [
                "بمانی",
                "سیریک"
            ],
            "مرکزی": [
                "بیاحان",
                "سیریک"
            ]
        },
        "قشم": {
            "حرا": [
                "دولاب",
                "صلخ",
                "طبل"
            ],
            "شهاب": [
                "سوزا",
                "رمکان"
            ],
            "مرکزی": [
                "قشم",
                "درگهان",
                "لارک",
                "هرمز"
            ]
        },
        "میناب": {
            "بندزرک": [
                "بندزرک",
                "کرگان"
            ],
            "توکهور": [
                "چراغ آباد",
                "توکهور",
                "هشتبندی"
            ],
            "سندرک": [
                "بندر",
                "درپهن",
                "سندرک"
            ],
            "مرکزی": [
                "حومه",
                "میناب",
                "گوربند",
                "تیاب"
            ]
        }
    },
    "همدان": {
        "اسدآباد": {
            "مرکزی": [
                "اسدآباد",
                "جلگه",
                "دربندرود",
                "سیدجمال الدین",
                "چهاردولی",
                "پیرسلیمان"
            ]
        },
        "بهار": {
            "صالح آباد": [
                "صالح آباد",
                "سیمینه رود"
            ],
            "لالجین": [
                "سفالگران",
                "مهاجران",
                "لالجین"
            ],
            "مرکزی": [
                "ابهررود",
                "سیمینه رود",
                "بهار"
            ]
        },
        "تویسرکان": {
            "قلقل رود": [
                "قلقل رود",
                "کمال رود",
                "میان رود"
            ],
            "مرکزی": [
                "حیقوق نبی",
                "خرمرود",
                "سیدشهاب",
                "کرزان رود",
                "تویسرکان",
                "سرکان",
                "فرسفج"
            ]
        },
        "رزن": {
            "سردرود": [
                "بغراطی",
                "رزن",
                "سردرودسفلی",
                "سردرودعلیا"
            ],
            "مرکزی": [
                "رزن",
                "خرقان"
            ]
        },
        "فامنین": {
            "پیشخور": [
                "پیشخور",
                "زردشت"
            ],
            "مرکزی": [
                "خرمدشت",
                "مفتح",
                "فامنین"
            ]
        },
        "قهاوند": {
            "مرکزی": [
                "قهاوند",
                "کوهین"
            ]
        },
        "کبودرآهنگ": {
            "شیرین سو": [
                "شیرین سو",
                "مهربان سفلی"
            ],
            "گل تپه": [
                "علیصدر",
                "گل تپه",
                "مهربان علیا"
            ],
            "مرکزی": [
                "حاجیلو",
                "راهب",
                "سبزدشت",
                "سرداران",
                "کبودرآهنگ",
                "کوهین",
                "داق داق آباد",
                "کوریجان"
            ]
        },
        "ملایر": {
            "جوکار": [
                "المهدی",
                "جوکار",
                "ترک غربی",
                "ترک شرقی"
            ],
            "سامن": [
                "حرم رودسفلی",
                "سامن",
                "سفیدکوه"
            ],
            "مرکزی": [
                "حرم رودعلیا",
                "موزاران",
                "کوه سرده",
                "ملایر",
                "ملایر 1",
                "ملایر 2",
                "ازندریان"
            ],
            "زند": [
                "کمازان سفلی",
                "کمازان علیا",
                "کمازان وسطی",
                "زنگنه"
            ]
        },
        "نهاوند": {
            "خزل": [
                "خزل شرقی",
                "سلگی",
                "فیروزان"
            ],
            "زرین دشت": [
                "شعبان",
                "گرین",
                "برزول"
            ],
            "گیان": [
                "گیان",
                "سراب"
            ],
            "مرکزی": [
                "شعبان",
                "طریق الاسلام",
                "گاماسیاب",
                "نهاوند"
            ]
        },
        "همدان": {
            "شراء": [
                "جیحون دشت",
                "شوردشت",
                "قهاوند"
            ],
            "مرکزی": [
                "ابهررود",
                "الوندکوه شرقی",
                "الوندکوه غربی",
                "سنگستان",
                "همدان",
                "همدان 1",
                "همدان 2",
                "همدان 3",
                "همدان 4",
                "هگمتانه",
                "قاسم آباد",
                "مریانج"
            ]
        }
    },
    "یزد": {
        "ابركوه": {
            "بهمن": [
                "اسفندار",
                "مهرآباد"
            ],
            "مركزی": [
                "تیجرد",
                "فراغه",
                "ابركوه"
            ]
        },
        "اردكان": {
            "خرانق": [
                "رباطات",
                "خرانق"
            ],
            "عقدا": [
                "عقدا",
                "نارستان"
            ],
            "مركزی": [
                "محمدیه",
                "اردكان",
                "احمدآباد"
            ]
        },
        "اشكذر": {
            "خضرآباد": [
                "كذاب"
            ],
            "مركزی": [
                "رستاق",
                "اشكذر"
            ]
        },
        "بافق": {
            "مركزی": [
                "مبارك",
                "سبزدشت",
                "كوشك",
                "بافق"
            ]
        },
        "بهاباد": {
            "آسفیج": [
                "آسفیج",
                "بنستان"
            ],
            "مركزی": [
                "جلگه",
                "بهاباد"
            ]
        },
        "تفت": {
            "نیر": [
                "زردین",
                "سخوید",
                "گاریزات",
                "نیر"
            ],
            "مركزی": [
                "پیشكوه",
                "دهشیر",
                "شیركوه",
                "علی آباد",
                "نصرآباد",
                "تفت"
            ]
        },
        "خاتم": {
            "هرات": [
                "هرات",
                "چاهك"
            ],
            "مروست": [
                "ایثار",
                "مروست",
                "هرابرجان"
            ]
        },
        "مهریز": {
            "مركزی": [
                "ارنان",
                "بهادران",
                "تنگ چنار",
                "خورمیز",
                "میانكوه",
                "مهریز"
            ]
        },
        "میبد": {
            "بفروییه": [
                "بفروییه",
                "درین"
            ],
            "ندوشن": [
                "ندوشن",
                "صدرآباد"
            ],
            "مركزی": [
                "شهداء",
                "میبد"
            ]
        },
        "یزد": {
            "زارچ": [
                "اله‌آباد",
                "بیداخوید",
                "محمدآباد"
            ],
            "مركزی": [
                "یزد",
                "یزد 1",
                "یزد 2",
                "یزد 3",
                "فهرج"
            ]
        }
    }
};

const placeCategoriesJSON = {
  "categories": [
    {
      "name": "خوراک و نوشیدنی",
      "items": [
        {"fa": "رستوران", "en": "restaurant"},
        {"fa": "فست‌فود", "en": "fast_food_restaurant"},
        {"fa": "کافه", "en": "cafe"},
        {"fa": "کافی‌شاپ", "en": "coffee_shop"},
        {"fa": "نانوایی", "en": "bakery"},
        {"fa": "شیرینی‌فروشی", "en": "dessert_shop"},
        {"fa": "بستنی‌فروشی", "en": "ice_cream_shop"},
        {"fa": "آبمیوه‌فروشی", "en": "juice_shop"},
        {"fa": "بار", "en": "bar"}
      ]
    },
    {
      "name": "خرید",
      "items": [
        {"fa": "مرکز خرید", "en": "shopping_mall"},
        {"fa": "سوپرمارکت", "en": "supermarket"},
        {"fa": "فروشگاه مواد غذایی", "en": "grocery_or_supermarket"},
        {"fa": "فروشگاه لباس", "en": "clothing_store"},
        {"fa": "فروشگاه الکترونیک", "en": "electronics_store"},
        {"fa": "کتاب‌فروشی", "en": "book_store"},
        {"fa": "طلافروشی", "en": "jewelry_store"},
        {"fa": "فروشگاه موبایل", "en": "mobile_store"},
        {"fa": "مغازه عمومی", "en": "store"}
      ]
    },
    {
      "name": "اقامت",
      "items": [
        {"fa": "هتل", "en": "hotel"},
        {"fa": "مسافرخانه / متل", "en": "motel"},
        {"fa": "اقامتگاه", "en": "lodging"},
        {"fa": "هاستل", "en": "hostel"},
        {"fa": "کمپینگ", "en": "campground"}
      ]
    },
    {
      "name": "خدمات خودرو و حمل‌ونقل",
      "items": [
        {"fa": "پمپ بنزین", "en": "gas_station"},
        {"fa": "پارکینگ", "en": "parking"},
        {"fa": "تعمیرگاه خودرو", "en": "car_repair"},
        {"fa": "نمایندگی خودرو", "en": "car_dealer"},
        {"fa": "کارواش", "en": "car_wash"},
        {"fa": "کرایه خودرو", "en": "car_rental"},
        {"fa": "ایستگاه اتوبوس", "en": "bus_station"},
        {"fa": "ایستگاه تاکسی", "en": "taxi_stand"},
        {"fa": "ایستگاه قطار", "en": "train_station"},
        {"fa": "ایستگاه مترو", "en": "subway_station"},
        {"fa": "فرودگاه", "en": "airport"}
      ]
    },
    {
      "name": "مالی و خدمات",
      "items": [
        {"fa": "بانک", "en": "bank"},
        {"fa": "خودپرداز", "en": "atm"},
        {"fa": "صرافی", "en": "currency_exchange"},
        {"fa": "اداره پست", "en": "post_office"},
        {"fa": "شرکت بیمه", "en": "insurance_agency"},
        {"fa": "آژانس مسافرتی", "en": "travel_agency"}
      ]
    },
    {
      "name": "بهداشت و درمان",
      "items": [
        {"fa": "بیمارستان", "en": "hospital"},
        {"fa": "درمانگاه", "en": "clinic"},
        {"fa": "پزشک", "en": "doctor"},
        {"fa": "دندانپزشک", "en": "dentist"},
        {"fa": "داروخانه", "en": "pharmacy"},
        {"fa": "فیزیوتراپی", "en": "physiotherapist"},
        {"fa": "دامپزشکی", "en": "veterinary_care"}
      ]
    },
    {
      "name": "تفریح، ورزش و سرگرمی",
      "items": [
        {"fa": "پارک", "en": "park"},
        {"fa": "پارک آبی", "en": "water_park"},
        {"fa": "شهربازی", "en": "amusement_park"},
        {"fa": "باغ‌وحش", "en": "zoo"},
        {"fa": "آکواریوم", "en": "aquarium"},
        {"fa": "سینما", "en": "movie_theater"},
        {"fa": "سالن بولینگ", "en": "bowling_alley"},
        {"fa": "سالن ورزشی", "en": "gym"},
        {"fa": "استادیوم", "en": "stadium"},
        {"fa": "زمین گلف", "en": "golf_course"}
      ]
    },
    {
      "name": "مذهبی و فرهنگی",
      "items": [
        {"fa": "مسجد", "en": "mosque"},
        {"fa": "کلیسا", "en": "church"},
        {"fa": "کنیسه", "en": "synagogue"},
        {"fa": "معبد هندو", "en": "hindu_temple"},
        {"fa": "موزه", "en": "museum"},
        {"fa": "گالری هنری", "en": "art_gallery"},
        {"fa": "کتابخانه", "en": "library"}
      ]
    },
    {
      "name": "اداری و دولتی",
      "items": [
        {"fa": "شهرداری", "en": "city_hall"},
        {"fa": "دادگاه", "en": "courthouse"},
        {"fa": "پلیس", "en": "police"},
        {"fa": "اداره دولتی", "en": "local_government_office"},
        {"fa": "سفارت", "en": "embassy"},
        {"fa": "پادگان", "en": "military_base"},
        {"fa": "آتش‌نشانی", "en": "fire_station"}
      ]
    }
  ]
};

const translations = {
    en: {
        site_name: "WhereIs?",
        find_places_title: "Find Places Near You",
        select_province: "Select Province",
        select_county: "Select County",
        select_city_village: "Select City/Village",
        categories: "Categories",
        subcategories: "Subcategories",
        nearest: "Nearest",
        best: "Best",
        no_results: "No results found in this area. Try a different search or location.",
        view_details: "View Details",
        getting_location: "Getting Location...",
        location_denied: "Location access denied. Please choose a location manually from the dropdowns or by clicking on the map.",
        location_unavailable: "Could not get your location. Please choose a location manually.",
        geolocation_not_supported: "Geolocation is not supported. Please choose a location manually.",
        location_not_found: "Could not find location for the selected city.",
        geocoding_error: "An error occurred while find the location.",
        search_error: "An error occurred during the search. Please try again.",
        location_data_load_error: "Could not load location list. Please reload the page.",
        use_my_location: "Use My Current Location",
        next: "Next",
        back: "Back",
        search: "Search",
        new_search: "New Search",
        location_selection_title: "Step 1: Choose a Location",
        category_selection_title: "Step 2: Select a Category",
        results_title: "Step 3: Discover Places",
        map_view_placeholder: "Map will be shown here",
        location_map_instruction: "You can also click on the map to set a location.",
        location_from_gps: "Your current location.",
        location_from_map: "Location selected on map.",
        location_from_dropdown: "Location from city selection.",
        use_my_location_title: "Fastest Option",
        select_from_list_title: "Select from a List",
        select_from_map_title: "Select on the Map",
        sdk_load_error_title: "Error!",
        sdk_load_error_message: "Could not load the map service. Please check your internet connection and try reloading the page.",
        distance_away: "away",
        navigate: "Navigate",
        confirm_location: "Confirm Location",
        navigate_with: "Navigate with...",
        navigate_neshan: "Neshan",
        navigate_google: "Google Maps",
        close: "Close",
        fastest_way_desc: "Automatically detect your position using GPS for a quick start.",
        select_from_list_desc: "Browse through provinces, counties, and cities to pinpoint a location.",
        pick_on_map_desc: "Click directly on the map to choose your exact point of interest.",
        login_title: "Login / Register",
        username: "Username",
        password: "Password",
        email: "Email Address",
        login: "Login",
        register: "Register",
        register_under_development: "This feature is under development.",
        quick_search_error: "Please select a location first.",
        open: "Open",
        closed: "Closed",
        directions: "Directions",
        call: "Call",
        share: "Share",
        save: "Save",
        votes: "votes",
        phone_not_available: "Phone number not available",
        search_placeholder: "Search for places (e.g., cafe, park)...",
        or_divider: "OR",
    },
    fa: {
        site_name: "کجاست؟",
        find_places_title: "مکان‌های نزدیک خود را پیدا کنید",
        select_province: "انتخاب استان",
        select_county: "انتخاب شهرستان",
        select_city_village: "انتخاب شهر/روستا",
        categories: "دسته‌بندی‌ها",
        subcategories: "زیرمجموعه‌ها",
        nearest: "نزدیک‌ترین",
        best: "بهترین",
        no_results: "نتیجه‌ای در این محدوده یافت نشد. جستجو یا مکان دیگری را امتحان کنید.",
        view_details: "مشاهده جزئیات",
        getting_location: "در حال دریافت موقعیت...",
        location_denied: "دسترسی به موقعیت مکانی رد شد. لطفاً یک مکان را به صورت دستی از منوها یا با کلیک روی نقشه انتخاب کنید.",
        location_unavailable: "موقعیت مکانی شما یافت نشد. لطفاً یک مکان را به صورت دستی انتخاب کنید.",
        geolocation_not_supported: "موقعیت‌یابی جغرافیایی پشتیبانی نمی‌شود. لطفاً یک مکان را به صورت دستی انتخاب کنید.",
        location_not_found: "موقعیت مکانی برای شهر انتخاب شده یافت نشد.",
        geocoding_error: "خطایی هنگام یافتن موقعیت مکانی رخ داد.",
        search_error: "خطایی در هنگام جستجو رخ داد. لطفا دوباره تلاش کنید.",
        location_data_load_error: "لیست موقعیت‌ها بارگیری نشد. لطفاً صفحه را دوباره بارگیری کنید.",
        use_my_location: "استفاده از مکان فعلی من",
        next: "بعدی",
        back: "بازگشت",
        search: "جستجو",
        new_search: "جستجوی جدید",
        location_selection_title: "مرحله ۱: انتخاب مکان",
        category_selection_title: "مرحله ۲: انتخاب دسته‌بندی",
        results_title: "مرحله ۳: نتایج جستجو",
        map_view_placeholder: "نقشه اینجا نمایش داده می‌شود",
        location_map_instruction: "می‌توانید برای تعیین مکان روی نقشه کلیک کنید.",
        location_from_gps: "مکان فعلی شما.",
        location_from_map: "مکان انتخاب شده روی نقشه.",
        location_from_dropdown: "مکان انتخاب شده از لیست شهرها.",
        use_my_location_title: "سریع‌ترین راه",
        select_from_list_title: "انتخاب از لیست",
        select_from_map_title: "انتخاب از روی نقشه",
        sdk_load_error_title: "خطا!",
        sdk_load_error_message: "سرویس نقشه بارگیری نشد. لطفاً اتصال اینترنت خود را بررسی کرده و صفحه را دوباره بارگیری کنید.",
        distance_away: "فاصله",
        navigate: "مسیریابی",
        confirm_location: "تایید مکان",
        navigate_with: "مسیریابی با...",
        navigate_neshan: "نشان",
        navigate_google: "گوگل مپ",
        close: "بستن",
        fastest_way_desc: "موقعیت خود را به صورت خودکار با GPS برای شروع سریع پیدا کنید.",
        select_from_list_desc: "برای مشخص کردن مکان، در میان استان‌ها، شهرستان‌ها و شهرها مرور کنید.",
        pick_on_map_desc: "برای انتخاب نقطه دقیق مورد نظر خود، مستقیماً روی نقشه کلیک کنید.",
        login_title: "ورود / ثبت نام",
        username: "نام کاربری",
        password: "رمز عبور",
        email: "آدرس ایمیل",
        login: "ورود",
        register: "ثبت نام",
        register_under_development: "این قابلیت در دست ساخت است.",
        quick_search_error: "لطفا ابتدا یک مکان را انتخاب کنید.",
        open: "باز",
        closed: "بسته",
        directions: "مسیرها",
        call: "تماس",
        share: "اشتراک‌گذاری",
        save: "ذخیره",
        votes: "رأی",
        phone_not_available: "شماره تلفن موجود نیست",
        search_placeholder: "جستجوی مکان‌ها (مثلاً کافه، پارک)...",
        or_divider: "یا",
    },
    ar: {
        site_name: "أين هو؟",
        find_places_title: "ابحث عن أماكن بالقرب منك",
        select_province: "اختر المحافظة",
        select_county: "اختر المقاطعة",
        select_city_village: "اختر المدينة / القرية",
        categories: "الفئات",
        subcategories: "فئات فرعية",
        nearest: "الأقرب",
        best: "الأفضل",
        no_results: "لم يتم العثور على نتائج في هذه المنطقة. جرب بحثًا أو موقعًا مختلفًا.",
        view_details: "عرض التفاصيل",
        getting_location: "جاري الحصول على الموقع...",
        location_denied: "تم رفض الوصول إلى الموقع. يرجى اختيار موقع يدويًا من القوائم أو بالنقر على الخريطة.",
        location_unavailable: "تعذر الحصول على موقعك. يرجى اختيار موقع يدويًا.",
        geolocation_not_supported: "تحديد الموقع الجغرافي غير مدعوم. يرجى اختيار موقع يدويًا.",
        location_not_found: "تعذر العثور على موقع للمدينة المحددة.",
        geocoding_error: "حدث خطأ أثناء العثور على الموقع.",
        search_error: "حدث خطأ أثناء البحث. يرجى المحاولة مرة أخرى.",
        location_data_load_error: "تعذر تحميل قائمة المواقع. يرجى إعادة تحميل الصفحة.",
        use_my_location: "استخدام موقعي الحالي",
        next: "التالي",
        back: "رجوع",
        search: "بحث",
        new_search: "بحث جديد",
        location_selection_title: "الخطوة ١: اختر موقعًا",
        category_selection_title: "الخطوة ٢: اختر فئة",
        results_title: "الخطوة ٣: اكتشف الأماكن",
        map_view_placeholder: "سيتم عرض الخريطة هنا",
        location_map_instruction: "يمكنك أيضًا النقر على الخريطة لتعيين موقع.",
        location_from_gps: "موقعك الحالي.",
        location_from_map: "الموقع المحدد على الخريطة.",
        location_from_dropdown: "الموقع المحدد من قائمة المدن.",
        use_my_location_title: "الخيار الأسرع",
        select_from_list_title: "اختر من القائمة",
        select_from_map_title: "اختر على الخريطة",
        sdk_load_error_title: "خطأ!",
        sdk_load_error_message: "تعذر تحميل خدمة الخريطة. يرجى التحقق من اتصالك بالإنترنت ومحاولة إعادة تحميل الصفحة.",
        distance_away: "مسافة",
        navigate: "اذهب",
        confirm_location: "تأكيد الموقع",
        navigate_with: "اذهب مع...",
        navigate_neshan: "نشان",
        navigate_google: "خرائط جوجل",
        close: "إغلاق",
        fastest_way_desc: "اكتشف موقعك تلقائيًا باستخدام GPS لبداية سريعة.",
        select_from_list_desc: "تصفح المحافظات والمقاطعات والمدن لتحديد موقع.",
        pick_on_map_desc: "انقر مباشرة على الخريطة لاختيار النقطة التي تهمك بالضبط.",
        login_title: "تسجيل الدخول / تسجيل",
        username: "اسم المستخدم",
        password: "كلمة المرور",
        email: "عنوان البريد الإلكتروني",
        login: "تسجيل الدخول",
        register: "تسجيل",
        register_under_development: "هذه الميزة قيد التطوير.",
        quick_search_error: "يرجى تحديد موقع أولاً.",
        open: "مفتوح",
        closed: "مغلق",
        directions: "الاتجاهات",
        call: "اتصال",
        share: "مشاركة",
        save: "حفظ",
        votes: "صوت",
        phone_not_available: "رقم الهاتف غير متوفر",
        search_placeholder: "ابحث عن أماكن (مثل مقهى، حديقة)...",
        or_divider: "أو",
    },
};

const categoryIcons = {
    "خوراک و نوشیدنی": "fas fa-utensils",
    "خرید": "fas fa-shopping-bag",
    "اقامت": "fas fa-bed",
    "خدمات خودرو و حمل‌ونقل": "fas fa-car",
    "مالی و خدمات": "fas fa-piggy-bank",
    "بهداشت و درمان": "fas fa-briefcase-medical",
    "تفریح، ورزش و سرگرمی": "fas fa-futbol",
    "مذهبی و فرهنگی": "fas fa-landmark",
    "اداری و دولتی": "fas fa-building-columns",
    "restaurant": "fas fa-utensils",
    "fast_food_restaurant": "fas fa-hamburger",
    "cafe": "fas fa-coffee",
    "coffee_shop": "fas fa-mug-hot",
    "bakery": "fas fa-bread-slice",
    "dessert_shop": "fas fa-cookie-bite",
    "ice_cream_shop": "fas fa-ice-cream",
    "juice_shop": "fas fa-martini-glass-citrus",
    "bar": "fas fa-glass-cheers",
    "shopping_mall": "fas fa-store",
    "supermarket": "fas fa-shopping-cart",
    "grocery_or_supermarket": "fas fa-carrot",
    "clothing_store": "fas fa-tshirt",
    "electronics_store": "fas fa-plug",
    "book_store": "fas fa-book-open",
    "jewelry_store": "fas fa-gem",
    "mobile_store": "fas fa-mobile-alt",
    "store": "fas fa-store-alt",
    "hotel": "fas fa-concierge-bell",
    "motel": "fas fa-hotel",
    "lodging": "fas fa-house-user",
    "hostel": "fas fa-building",
    "campground": "fas fa-campground",
    "gas_station": "fas fa-gas-pump",
    "parking": "fas fa-parking",
    "car_repair": "fas fa-tools",
    "car_dealer": "fas fa-car-side",
    "car_wash": "fas fa-tint",
    "car_rental": "fas fa-car-alt",
    "bus_station": "fas fa-bus",
    "taxi_stand": "fas fa-taxi",
    "train_station": "fas fa-train",
    "subway_station": "fas fa-subway",
    "airport": "fas fa-plane-departure",
    "bank": "fas fa-university",
    "atm": "fas fa-credit-card",
    "currency_exchange": "fas fa-dollar-sign",
    "post_office": "fas fa-envelope",
    "insurance_agency": "fas fa-shield-alt",
    "travel_agency": "fas fa-suitcase-rolling",
    "hospital": "fas fa-hospital",
    "clinic": "fas fa-clinic-medical",
    "doctor": "fas fa-user-md",
    "dentist": "fas fa-tooth",
    "pharmacy": "fas fa-pills",
    "physiotherapist": "fas fa-running",
    "veterinary_care": "fas fa-paw",
    "park": "fas fa-tree",
    "water_park": "fas fa-swimmer",
    "amusement_park": "fas fa-ferris-wheel",
    "zoo": "fas fa-hippo",
    "aquarium": "fas fa-fish",
    "movie_theater": "fas fa-film",
    "bowling_alley": "fas fa-bowling-ball",
    "gym": "fas fa-dumbbell",
    "stadium": "fas fa-flag-checkered",
    "golf_course": "fas fa-golf-ball",
    "mosque": "fas fa-mosque",
    "church": "fas fa-church",
    "synagogue": "fas fa-synagogue",
    "hindu_temple": "fas fa-gopuram",
    "museum": "fas fa-landmark",
    "art_gallery": "fas fa-palette",
    "library": "fas fa-book",
    "city_hall": "fas fa-building",
    "courthouse": "fas fa-gavel",
    "police": "fas fa-user-shield",
    "local_government_office": "fas fa-landmark",
    "embassy": "fas fa-flag",
    "military_base": "fas fa-shield-halved",
    "fire_station": "fas fa-fire-extinguisher",
};


const initializeApplication = () => {
    // --- STATE ---
    let currentLang = 'fa';
    let divisionsData: any = divisionsDataJSON;
    let placeCategories: any[] = placeCategoriesJSON.categories;
    let userLocation: { lat: number | null, lng: number | null } = { lat: null, lng: null };
    let locationMap: any = null;
    let resultsMap: any = null;
    let locationMarker: any = null;
    let resultMarkersMap = new Map<string, any>();
    let highlightedMarkerInfo: { marker: any; originalIcon: any } | null = null;
    let isochroneLayer: any = null;
    let selectedSubCategories = new Set<string>();
    let currentResults: any[] = [];
    let originalResults: any[] = [];
    let isDarkMode = false;
    let activeSortTab: 'nearest' | 'best' = 'nearest';
    const NESHAN_WEB_API_KEY = "web.36ff66f5c7c54199843b838e079237f6";
    const NESHAN_SERVICE_API_KEY = "service.267bed159b794099b813606c16305664";
    const tehranCoords = { lat: 35.6892, lng: 51.3890 };

    // --- PAGE ELEMENTS ---
    const pageLocation = document.getElementById('page-location');
    const pageCategory = document.getElementById('page-category');
    const pageResults = document.getElementById('page-results');

    // --- UI ELEMENTS ---
    const langButtons = document.querySelectorAll('.lang-btn');
    const siteNameBtn = document.getElementById('site-name-btn');
    const provinceSelect = document.getElementById('province-select') as HTMLSelectElement;
    const countySelect = document.getElementById('county-select') as HTMLSelectElement;
    const cityVillageSelect = document.getElementById('city-village-select') as HTMLSelectElement;
    const confirmLocationBtn = document.getElementById('confirm-location-btn') as HTMLButtonElement;
    const themeToggleBtn = document.getElementById('theme-toggle-btn');
    const quickSearchInput = document.getElementById('quick-search-input') as HTMLInputElement;
    const quickSearchError = document.getElementById('quick-search-error');
    const languageDropdownToggle = document.getElementById('language-dropdown-toggle');
    const languageDropdownMenu = document.getElementById('language-dropdown-menu');
    const currentLangFlag = document.getElementById('current-lang-flag');

    const locationDataError = document.getElementById('location-data-error');
    const useMyLocationBtn = document.getElementById('use-my-location-btn') as HTMLButtonElement;
    const locationStatus = document.getElementById('location-status');
    
    // Category Page Elements
    const mainCategoriesView = document.getElementById('main-categories-view');
    const subCategoriesView = document.getElementById('sub-categories-view');
    const backToMainCategoriesBtn = document.getElementById('back-to-main-categories-btn');

    // User/Login Modal Elements
    const userIconBtn = document.getElementById('user-icon-btn');
    const loginModal = document.getElementById('login-modal');
    const loginModalClose = document.getElementById('login-modal-close');
    const registerBtn = document.getElementById('register-btn');
    const registerMessage = document.getElementById('register-message');


    const resultsList = document.getElementById('results-list');
    const navModal = document.getElementById('nav-modal');
    const navModalClose = document.getElementById('nav-modal-close');
    const navNeshanLink = document.getElementById('nav-neshan-link') as HTMLAnchorElement;
    const navGoogleLink = document.getElementById('nav-google-link') as HTMLAnchorElement;

    // Results Page Sort Tabs
    const sortNearestBtn = document.getElementById('sort-nearest-btn');
    const sortBestBtn = document.getElementById('sort-best-btn');


    // --- NAVIGATION BUTTONS ---
    const nextToCategoryBtn = document.getElementById('next-to-category-btn') as HTMLButtonElement;
    const backToLocationBtn = document.getElementById('back-to-location-btn');
    const searchBtn = document.getElementById('search-btn') as HTMLButtonElement;
    const backToCategoryBtn = document.getElementById('back-to-category-btn');
    const newSearchBtn = document.getElementById('new-search-btn');

    // --- PAGE MANAGEMENT ---
    const showPage = (pageToShow) => {
        [pageLocation, pageCategory, pageResults].forEach(page => {
            page?.classList.toggle('hidden', page !== pageToShow);
        });
    };
    
    // --- UI STATE MANAGEMENT ---
    const updateLocationUI = () => {
        const hasLocation = userLocation.lat !== null && userLocation.lng !== null;
        if (nextToCategoryBtn) {
            nextToCategoryBtn.disabled = !hasLocation;
        }
        const citySelected = cityVillageSelect && cityVillageSelect.value !== '';
        if (confirmLocationBtn) {
            confirmLocationBtn.disabled = !citySelected;
        }
    };
    
    const updateCategoryUI = () => {
        searchBtn.disabled = selectedSubCategories.size === 0 && quickSearchInput.value.trim() === '';
    };

    const goToCategoryPage = () => {
        showPage(pageCategory);
        renderCategoryFilters();
        updateCategoryUI();
    };

    // --- LANGUAGE & TRANSLATION ---
    const langFlags = {
        fa: '🇮🇷',
        en: '🇬🇧',
        ar: '🇸🇦'
    };
    const switchLanguage = (lang) => {
        currentLang = lang;
        const isRTL = lang === 'fa' || lang === 'ar';
        document.documentElement.lang = lang;
        document.documentElement.dir = isRTL ? 'rtl' : 'ltr';

        if (currentLangFlag) {
            currentLangFlag.textContent = langFlags[lang];
        }

        document.querySelectorAll('[data-translate-key]').forEach(el => {
            const htmlEl = el as HTMLElement;
            const key = htmlEl.dataset.translateKey;
            if (key && translations[lang][key]) {
                const translation = translations[lang][key];
                if (htmlEl.hasAttribute('placeholder')) {
                    (htmlEl as HTMLInputElement).placeholder = translation;
                } else {
                    el.textContent = translation;
                }
            }
        });
        
        if (provinceSelect.value === '') provinceSelect.firstElementChild.textContent = `-- ${translations[currentLang]['select_province']} --`;
        if (countySelect.value === '') countySelect.firstElementChild.textContent = `-- ${translations[currentLang]['select_county']} --`;
        if (cityVillageSelect.value === '') cityVillageSelect.firstElementChild.textContent = `-- ${translations[currentLang]['select_city_village']} --`;
        
        renderCategoryFilters();
        if(pageResults && !pageResults.classList.contains('hidden')) {
            sortAndRenderResults();
        }
    };

    // --- THEME ---
    const applyTheme = (theme: 'light' | 'dark') => {
        isDarkMode = theme === 'dark';
        document.documentElement.dataset.theme = theme;
        if (themeToggleBtn) {
            themeToggleBtn.innerHTML = `<i class="fas fa-${theme === 'dark' ? 'sun' : 'moon'}"></i>`;
        }
        localStorage.setItem('whereis-theme', theme);
        // Re-initialize maps if they exist to apply dark theme tiles
        if (locationMap) initializeLocationMap(true);
        if (resultsMap) initializeResultsMap(true);
    };

    const toggleTheme = () => {
        applyTheme(isDarkMode ? 'light' : 'dark');
    };

    // --- MAP FUNCTIONS ---
    const initializeLocationMap = (forceRecreate = false) => {
        if (locationMap && !forceRecreate) return;
        try {
            const mapElement = document.getElementById('location-map');
            if (mapElement) {
                if (locationMap) locationMap.remove();
                mapElement.innerHTML = '';
                 locationMap = new L.Map('location-map', {
                    key: NESHAN_WEB_API_KEY,
                    maptype: isDarkMode ? 'standard-night' : 'dreamy',
                    poi: true,
                    traffic: false,
                    center: [tehranCoords.lat, tehranCoords.lng],
                    zoom: 12
                });

                locationMap.on('click', (e) => {
                    userLocation = { lat: e.latlng.lat, lng: e.latlng.lng };
                    updateLocationMarker(userLocation.lat, userLocation.lng);
                    locationStatus.textContent = translations[currentLang]['location_from_map'];
                    updateLocationUI();
                });
            }
        } catch(e) {
            console.error("Map SDK Error: ", e);
             const mapElement = document.getElementById('location-map');
             if(mapElement) {
                mapElement.innerHTML = `<div class="p-4 bg-red-100 text-red-700 rounded-lg">
                    <p class="font-bold" data-translate-key="sdk_load_error_title">${translations[currentLang]['sdk_load_error_title']}</p>
                    <p data-translate-key="sdk_load_error_message">${translations[currentLang]['sdk_load_error_message']}</p>
                </div>`;
            }
        }
    };
    
    const initializeResultsMap = (forceRecreate = false) => {
         if (resultsMap && !forceRecreate) return;
         try {
            const mapElement = document.getElementById('results-map');
            if(mapElement) {
                if(resultsMap) resultsMap.remove();
                mapElement.innerHTML = '';
                resultsMap = new L.Map('results-map', {
                    key: NESHAN_WEB_API_KEY,
                    maptype: isDarkMode ? 'standard-night' : 'dreamy',
                    poi: true,
                    traffic: false,
                    center: [userLocation.lat || tehranCoords.lat, userLocation.lng || tehranCoords.lng],
                    zoom: 13
                });
            }
        } catch(e) {
             console.error("Map SDK Error: ", e);
             const mapElement = document.getElementById('results-map');
             if(mapElement) {
                mapElement.innerHTML = `<div class="p-4 bg-red-100 text-red-700 rounded-lg">
                    <p class="font-bold" data-translate-key="sdk_load_error_title">${translations[currentLang]['sdk_load_error_title']}</p>
                    <p data-translate-key="sdk_load_error_message">${translations[currentLang]['sdk_load_error_message']}</p>
                </div>`;
            }
        }
    };

    const updateLocationMarker = (lat, lng, zoom = 15) => {
        if (!locationMap) initializeLocationMap();
        if (locationMarker) {
            locationMarker.setLatLng([lat, lng]);
        } else {
            locationMarker = L.marker([lat, lng]).addTo(locationMap);
        }
        locationMap.flyTo([lat, lng], zoom);
    };
    
    const highlightResultOnMap = (uid: string) => {
        const markerToHighlight = resultMarkersMap.get(uid);
        const result = currentResults.find(r => r.uid === uid);

        if (!markerToHighlight || !result) return;
        
        // Reset previously highlighted marker
        if (highlightedMarkerInfo) {
            highlightedMarkerInfo.marker.setIcon(highlightedMarkerInfo.originalIcon);
        }

        const highlightedIcon = L.icon({
            iconUrl: 'https://raw.githubusercontent.com/pointhi/leaflet-color-markers/master/img/marker-icon-green.png',
            shadowUrl: 'https://cdnjs.cloudflare.com/ajax/libs/leaflet/0.7.7/images/marker-shadow.png',
            iconSize: [25, 41],
            iconAnchor: [12, 41],
            popupAnchor: [1, -34],
            shadowSize: [41, 41]
        });
        
        // Highlight the new one
        highlightedMarkerInfo = {
            marker: markerToHighlight,
            originalIcon: markerToHighlight.options.icon
        };
        markerToHighlight.setIcon(highlightedIcon);
        markerToHighlight.setZIndexOffset(1000).openPopup();

        resultsMap.flyTo([result.location.y, result.location.x], 16);
    };

    const updateResultsMap = () => {
        if (!resultsMap) initializeResultsMap();
    
        // Clear previous markers from map and state
        resultMarkersMap.forEach(marker => resultsMap.removeLayer(marker));
        resultMarkersMap.clear();
        highlightedMarkerInfo = null;

        if (isochroneLayer) resultsMap.removeLayer(isochroneLayer);
    
        const userMarkerIcon = L.icon({
            iconUrl: 'https://raw.githubusercontent.com/pointhi/leaflet-color-markers/master/img/marker-icon-red.png',
            shadowUrl: 'https://cdnjs.cloudflare.com/ajax/libs/leaflet/0.7.7/images/marker-shadow.png',
            iconSize: [25, 41],
            iconAnchor: [12, 41],
            popupAnchor: [1, -34],
            shadowSize: [41, 41]
        });

        const resultMarkerIcon = L.icon({
            iconUrl: 'https://unpkg.com/leaflet@1.9.4/dist/images/marker-icon.png',
            shadowUrl: 'https://unpkg.com/leaflet@1.9.4/dist/images/marker-shadow.png',
            iconSize: [25, 41],
            iconAnchor: [12, 41],
            popupAnchor: [1, -34],
            shadowSize: [41, 41]
        });
    
        if (userLocation.lat && userLocation.lng) {
            L.marker([userLocation.lat, userLocation.lng], { icon: userMarkerIcon }).addTo(resultsMap)
                .bindPopup(translations[currentLang]['location_from_gps'])
                .openPopup();
        }
    
        const bounds = L.latLngBounds();
        if (userLocation.lat && userLocation.lng) {
            bounds.extend([userLocation.lat, userLocation.lng]);
        }
    
        const resultsToDisplay = currentResults;
    
        resultsToDisplay.forEach((result) => {
            const { location, uid } = result;
            if (location) {
                const marker = L.marker([location.y, location.x], { icon: resultMarkerIcon }).addTo(resultsMap);
                const categoryName = getCategoryDisplayName(result.type);
                marker.bindPopup(`<b>${result.title}</b><br>${categoryName}`);
                resultMarkersMap.set(uid, marker);
                bounds.extend([location.y, location.x]);
            }
        });
    
        if (bounds.isValid() && resultsToDisplay.length > 0) {
            resultsMap.fitBounds(bounds, { padding: [50, 50] });
        } else if (userLocation.lat && userLocation.lng) {
            resultsMap.setView([userLocation.lat, userLocation.lng], 13);
        }
    };

    const setStatus = (key, isError = false) => {
        if(!locationStatus) return;
        locationStatus.textContent = translations[currentLang][key];
        locationStatus.classList.toggle('text-red-500', isError);
        locationStatus.classList.toggle('text-gray-600', !isError);
        locationStatus.classList.toggle('dark:text-gray-400', !isError);
    };

    // --- LOCATION HANDLING ---
    const handleUseMyLocation = () => {
        if (!navigator.geolocation) {
            setStatus('geolocation_not_supported', true);
            return;
        }
        setStatus('getting_location');
        navigator.geolocation.getCurrentPosition(position => {
            userLocation = { lat: position.coords.latitude, lng: position.coords.longitude };
            updateLocationMarker(userLocation.lat, userLocation.lng);
            setStatus('location_from_gps');
            updateLocationUI();
        }, error => {
            switch (error.code) {
                case error.PERMISSION_DENIED:
                    setStatus('location_denied', true);
                    break;
                case error.POSITION_UNAVAILABLE:
                    setStatus('location_unavailable', true);
                    break;
                case error.TIMEOUT:
                    setStatus('location_unavailable', true);
                    break;
            }
            updateLocationUI();
        });
    };
    
    const geocodeCity = async (province, county, city) => {
        const address = `${province}, ${county}, ${city}`;
        setStatus('getting_location');
        try {
            const response = await fetch(`https://api.neshan.org/v1/geocoding?address=${encodeURIComponent(address)}`, {
                headers: { 'Api-Key': NESHAN_SERVICE_API_KEY }
            });
            const data = await response.json();
            if (data.status === 'OK' && data.location) {
                userLocation = { lat: data.location.y, lng: data.location.x };
                updateLocationMarker(userLocation.lat, userLocation.lng);
                setStatus('location_from_dropdown');
                updateLocationUI();
            } else {
                setStatus('location_not_found', true);
                userLocation = { lat: null, lng: null };
            }
        } catch (error) {
            setStatus('geocoding_error', true);
            userLocation = { lat: null, lng: null };
        }
        updateLocationUI();
    };

    const handleConfirmLocation = () => {
        const province = provinceSelect.options[provinceSelect.selectedIndex].text;
        const county = countySelect.options[countySelect.selectedIndex].text;
        const city = cityVillageSelect.value;
        if(city) {
            geocodeCity(province, county, city);
        }
    };

    // --- DATA LOADING & POPULATION ---
    const populateProvinces = () => {
        provinceSelect.innerHTML = `<option value="">-- ${translations[currentLang]['select_province']} --</option>`;
        Object.keys(divisionsData).forEach(province => {
            const option = document.createElement('option');
            option.value = province;
            option.textContent = province;
            provinceSelect.appendChild(option);
        });
        provinceSelect.disabled = false;
        provinceSelect.classList.remove('bg-gray-200', 'cursor-not-allowed');
    };

    const populateCounties = (province) => {
        countySelect.innerHTML = `<option value="">-- ${translations[currentLang]['select_county']} --</option>`;
        cityVillageSelect.innerHTML = `<option value="">-- ${translations[currentLang]['select_city_village']} --</option>`;
        cityVillageSelect.disabled = true;
        cityVillageSelect.classList.add('bg-gray-200', 'cursor-not-allowed');
        
        if (province && divisionsData[province]) {
            Object.keys(divisionsData[province]).forEach(county => {
                const option = document.createElement('option');
                option.value = county;
                option.textContent = county;
                countySelect.appendChild(option);
            });
            countySelect.disabled = false;
            countySelect.classList.remove('bg-gray-200', 'cursor-not-allowed');
        } else {
             countySelect.disabled = true;
             countySelect.classList.add('bg-gray-200', 'cursor-not-allowed');
        }
    };

    const populateCities = (province, county) => {
        cityVillageSelect.innerHTML = `<option value="">-- ${translations[currentLang]['select_city_village']} --</option>`;
        if (province && county && divisionsData[province]?.[county]) {
            const citiesAndVillages = new Set<string>();
            Object.values(divisionsData[province][county]).forEach((district: any) => {
                district.forEach(item => citiesAndVillages.add(item));
            });

            Array.from(citiesAndVillages).sort().forEach(city => {
                const option = document.createElement('option');
                option.value = city;
                option.textContent = city;
                cityVillageSelect.appendChild(option);
            });
            cityVillageSelect.disabled = false;
            cityVillageSelect.classList.remove('bg-gray-200', 'cursor-not-allowed');
        } else {
            cityVillageSelect.disabled = true;
            cityVillageSelect.classList.add('bg-gray-200', 'cursor-not-allowed');
        }
    };

    // --- CATEGORY & SEARCH ---
    
    const getCategoryDisplayName = (type, lang = currentLang) => {
        for (const mainCategory of placeCategories) {
            for (const item of mainCategory.items) {
                if (item.en === type) {
                    return lang === 'fa' ? item.fa : item.en.replace(/_/g, ' ');
                }
            }
        }
        return type.replace(/_/g, ' ');
    };
    
    const renderCategoryFilters = (mainCategoryName: string | null = null) => {
        if (!mainCategoriesView || !subCategoriesView) return;
        if (!mainCategoryName) {
            mainCategoriesView.innerHTML = '';
            subCategoriesView.classList.add('hidden');
            mainCategoriesView.classList.remove('hidden');
            backToMainCategoriesBtn.classList.add('hidden');
            
            const grid = document.createElement('div');
            grid.className = 'category-grid';

            placeCategories.forEach(category => {
                const btn = document.createElement('button');
                btn.className = 'category-icon-btn';
                btn.dataset.category = category.name;
                
                const iconClass = categoryIcons[category.name] || 'fas fa-question-circle';
                const iconName = currentLang === 'fa' ? category.name : category.name;

                btn.innerHTML = `<i class="${iconClass}"></i><span>${iconName}</span>`;
                btn.onclick = () => renderCategoryFilters(category.name);
                grid.appendChild(btn);
            });
            mainCategoriesView.appendChild(grid);
        } else {
            mainCategoriesView.classList.add('hidden');
            subCategoriesView.classList.remove('hidden');
            subCategoriesView.innerHTML = '';
            backToMainCategoriesBtn.classList.remove('hidden');
            
            const category = placeCategories.find(c => c.name === mainCategoryName);
            if (category) {
                const grid = document.createElement('div');
                grid.className = 'category-grid';
                
                category.items.forEach(item => {
                    const btn = document.createElement('button');
                    btn.className = 'category-icon-btn';
                    btn.dataset.subcategoryEn = item.en;
                    btn.dataset.subcategoryFa = item.fa;

                    if (selectedSubCategories.has(item.en)) {
                        btn.classList.add('selected');
                    }
                    
                    const iconClass = categoryIcons[item.en] || 'fas fa-map-marker-alt';
                    const iconName = currentLang === 'fa' ? item.fa : item.en.replace(/_/g, ' ');
                    
                    btn.innerHTML = `<i class="${iconClass}"></i><span>${iconName}</span>`;
                    btn.onclick = () => {
                        btn.classList.toggle('selected');
                        if (selectedSubCategories.has(item.en)) {
                            selectedSubCategories.delete(item.en);
                        } else {
                            selectedSubCategories.add(item.en);
                        }
                        updateCategoryUI();
                    };
                    grid.appendChild(btn);
                });
                subCategoriesView.appendChild(grid);
            }
        }
    };
    
    const searchPlaces = async () => {
        showPage(pageResults);
        renderSkeletons();
        initializeResultsMap();

        const searchTerms = new Set(selectedSubCategories);
        const quickSearchTerm = quickSearchInput.value.trim();
        if(quickSearchTerm) {
            searchTerms.add(quickSearchTerm);
        }
    
        const oldWarning = document.getElementById('search-warning');
        if (oldWarning) oldWarning.parentElement.removeChild(oldWarning);
    
        const lat = userLocation.lat;
        const lng = userLocation.lng;
    
        if (!lat || !lng) {
            if (resultsList) resultsList.innerHTML = `<div class="text-center p-4 text-red-500">${translations[currentLang]['quick_search_error']}</div>`;
            return;
        }
    
        const searchPromises = Array.from(searchTerms).map(term => {
            const url = `https://api.neshan.org/v1/search?term=${term}&lat=${lat}&lng=${lng}`;
            return fetch(url, { headers: { 'Api-Key': NESHAN_SERVICE_API_KEY } }).then(async res => {
                if (!res.ok) {
                    let errorBody = 'Could not read error body.';
                    try { errorBody = await res.text(); } catch (e) {}
                    if (errorBody.trim().startsWith('<')) {
                        errorBody = "Received an HTML error page from the server."
                    }
                    throw new Error(`Neshan API error for term '${term}': ${errorBody.trim()}`);
                }
                const data = await res.json();
                if (typeof data.count === 'undefined' || typeof data.items === 'undefined') {
                    throw new Error(`Received an unexpected response format for term '${term}'.`);
                }
                return data;
            }).catch(networkError => {
                throw new Error(`Network error for term '${term}': ${networkError.message}`);
            });
        });
    
        const settledResults = await Promise.allSettled(searchPromises);
        
        const successfulResults = settledResults
            .filter(r => r.status === 'fulfilled')
            .map(r => (r as PromiseFulfilledResult<any>).value);

        const failedReasons = settledResults
            .filter(r => r.status === 'rejected')
            .map(r => (r as PromiseRejectedResult).reason);

        const combinedResults = successfulResults.flatMap(result => result.items || []);

        if (failedReasons.length > 0) {
            console.error("Some search requests failed:", failedReasons);

            const getErrorMessage = (reason: any): string => {
                if (reason instanceof Error) {
                    return reason.message;
                }
                if (typeof reason === 'object' && reason !== null) {
                    try {
                        const serialized = JSON.stringify(reason, Object.getOwnPropertyNames(reason));
                        if (serialized === '{}') return 'Empty error object received.';
                        return serialized;
                    } catch (e) {
                        return "Could not serialize circular error object.";
                    }
                }
                return String(reason);
            };

            if (combinedResults.length === 0) {
                const errorDetails = failedReasons.map(getErrorMessage).join('\n');
                if (resultsList) {
                    resultsList.innerHTML = `<div class="text-center p-4 text-red-500">${translations[currentLang]['search_error']}<br><pre class="text-xs text-left mt-2 whitespace-pre-wrap">${errorDetails}</pre></div>`;
                }
                currentResults = []; 
                updateResultsMap();
                return; 
            } else {
                if (resultsList && resultsList.parentElement) {
                     const errorContainer = document.createElement('div');
                     errorContainer.id = 'search-warning';
                     errorContainer.className = 'p-3 mb-4 bg-yellow-100 dark:bg-gray-700 text-yellow-800 dark:text-yellow-200 rounded-lg text-sm';
                     
                     const failedTerms = failedReasons.map(reason => {
                         const message = getErrorMessage(reason);
                         const match = message.match(/'(.*?)'/);
                         return match ? getCategoryDisplayName(match[1]) : 'Unknown category';
                     }).join(', ');

                     errorContainer.textContent = `Could not fetch results for: ${failedTerms}. Showing other results.`;
                     resultsList.parentElement.insertBefore(errorContainer, resultsList);
                }
            }
        }

        if (combinedResults.length === 0) {
             currentResults = [];
             originalResults = [];
             sortAndRenderResults();
             return;
        }

        const uniqueResults = Array.from(new Map(combinedResults.map(item => [`${item.title}-${item.location.x}-${item.location.y}`, item])).values());
        
        const calculateDistance = (lat1: number, lon1: number, lat2: number, lon2: number) => {
            const R = 6371e3; // metres
            const φ1 = lat1 * Math.PI/180;
            const φ2 = lat2 * Math.PI/180;
            const Δφ = (lat2-lat1) * Math.PI/180;
            const Δλ = (lon2-lon1) * Math.PI/180;

            const a = Math.sin(Δφ/2) * Math.sin(Δφ/2) +
                      Math.cos(φ1) * Math.cos(φ2) *
                      Math.sin(Δλ/2) * Math.sin(Δλ/2);
            const c = 2 * Math.atan2(Math.sqrt(a), Math.sqrt(1-a));

            return R * c; // in metres
        };

        const resultsWithDistance = uniqueResults.map(r => ({
            ...r,
            distance: {
                value: calculateDistance(lat, lng, r.location.y, r.location.x),
                text: '' // Keep structure, though text is not used
            }
        }));
        
        const proximityLimitMeters = 25 * 1000; // 25km
        const resultsWithinProximity = resultsWithDistance.filter(r => r.distance.value <= proximityLimitMeters);

        if (resultsWithinProximity.length === 0) {
            currentResults = [];
            originalResults = [];
            sortAndRenderResults();
            return;
        }

        originalResults = resultsWithinProximity.map(r => {
            return {
                ...r,
                uid: `${r.title}-${r.location.y}-${r.location.x}`
            };
        });
        
        sortAndRenderResults();
    };
    
    const handleQuickSearch = () => {
        const term = quickSearchInput.value.trim();
        if (!term && selectedSubCategories.size === 0) return;

        if (userLocation.lat === null || userLocation.lng === null) {
            quickSearchError.textContent = translations[currentLang]['quick_search_error'];
            quickSearchError.classList.remove('hidden');
            setTimeout(() => quickSearchError.classList.add('hidden'), 3000);
            return;
        }
        searchPlaces();
    };

    // --- RESULTS RENDERING & SORTING ---
    const sortAndRenderResults = () => {
        currentResults = [...originalResults];

        if (activeSortTab === 'nearest') {
            currentResults.sort((a, b) => a.distance.value - b.distance.value);
        } else { // 'best'
            currentResults.sort((a, b) => b.votes - a.votes);
        }
        
        // Update tab UI
        if(sortNearestBtn && sortBestBtn) {
            sortNearestBtn.classList.toggle('active', activeSortTab === 'nearest');
            sortBestBtn.classList.toggle('active', activeSortTab === 'best');
        }

        renderResults();
    };

    const renderSkeletons = () => {
        if (!resultsList) return;
        resultsList.innerHTML = '';
        for (let i = 0; i < 4; i++) {
            const skeletonCard = document.createElement('div');
            skeletonCard.className = 'bg-white dark:bg-gray-800 p-4 rounded-lg shadow-md border dark:border-gray-700 flex flex-col gap-3';
            skeletonCard.innerHTML = `
                <div class="flex items-start gap-3">
                    <div class="skeleton skeleton-icon"></div>
                    <div class="flex-grow space-y-3">
                        <div class="skeleton skeleton-title"></div>
                        <div class="skeleton skeleton-text w-3/4"></div>
                        <div class="skeleton skeleton-text-sm w-1/2"></div>
                    </div>
                </div>
                <div class="skeleton skeleton-text"></div>
                <div class="mt-auto pt-3 border-t dark:border-gray-700 flex justify-around">
                    <div class="skeleton skeleton-button w-16 h-10"></div>
                    <div class="skeleton skeleton-button w-16 h-10"></div>
                    <div class="skeleton skeleton-button w-16 h-10"></div>
                </div>
            `;
            resultsList.appendChild(skeletonCard);
        }
    }

    const renderResults = () => {
        if(!resultsList) return;
        resultsList.innerHTML = '';
        
        const resultsToDisplay = currentResults;

        if (resultsToDisplay.length === 0) {
            const oldWarning = document.getElementById('search-warning');
            if (!oldWarning) { // Don't show "no results" if there's already a partial error warning
               resultsList.innerHTML = `<div class="text-center p-4 text-gray-600 dark:text-gray-300">${translations[currentLang]['no_results']}</div>`;
            }
            updateResultsMap();
            return;
        }

        resultsToDisplay.forEach(result => {
            const card = document.createElement('div');
            card.className = 'result-card bg-white dark:bg-gray-800 rounded-lg shadow-md border dark:border-gray-700 flex flex-col relative transition-all duration-200 hover:shadow-xl hover:-translate-y-1 cursor-pointer';
            card.dataset.uid = result.uid;

            const distance = (result.distance.value / 1000).toFixed(1);
            const categoryName = getCategoryDisplayName(result.type);
            const iconClass = categoryIcons[result.type] || 'fas fa-map-marker-alt';
            
            card.innerHTML = `
                <!-- Main Content Area -->
                <div class="p-4 flex-grow">
                    <div class="flex items-start gap-3">
                        <div class="bg-light dark:bg-gray-700 p-3 rounded-full flex-shrink-0">
                            <i class="${iconClass} text-primary dark:text-secondary text-xl"></i>
                        </div>
                        <div class="flex-grow">
                            <h3 class="font-bold text-dark dark:text-white text-lg truncate">${result.title}</h3>
                             <div class="flex justify-between items-center text-sm text-gray-500 dark:text-gray-400 mt-1">
                                <p>${categoryName}</p>
                                <p>${distance} km ${translations[currentLang]['distance_away']}</p>
                            </div>
                        </div>
                    </div>

                    <p class="text-sm text-gray-600 dark:text-gray-300 mt-3 truncate">${result.address || ''}</p>
                </div>

                <!-- Action Bar -->
                <div class="action-bar-container mt-auto p-2 border-t dark:border-gray-700 flex justify-around items-center">
                    <button class="action-bar-btn navigate-btn" data-lat="${result.location.y}" data-lng="${result.location.x}" data-title="${result.title}">
                        <i class="fas fa-route"></i>
                        <span data-translate-key="directions">${translations[currentLang]['directions']}</span>
                    </button>
                     <div class="action-bar-btn" title="${result.votes} ${translations[currentLang]['votes']}">
                        <i class="fas fa-star text-accent"></i>
                        <span>${result.votes}</span>
                    </div>
                    <button class="action-bar-btn share-btn">
                        <i class="fas fa-share-alt"></i>
                        <span data-translate-key="share">${translations[currentLang]['share']}</span>
                    </button>
                </div>
            `;
            resultsList.appendChild(card);
            
            card.addEventListener('click', (e) => {
                const target = e.target as HTMLElement;
                // Don't highlight map if a button inside the card was clicked
                if (target.closest('.action-bar-btn')) {
                    return;
                }
                const uid = (e.currentTarget as HTMLElement).dataset.uid;
                if(uid) highlightResultOnMap(uid);
            });

            card.querySelector('.navigate-btn').addEventListener('click', (e) => {
                e.stopPropagation();
                const target = e.currentTarget as HTMLElement;
                openNavModal(target.dataset.lat, target.dataset.lng, target.dataset.title);
            });
            
             card.querySelector('.share-btn').addEventListener('click', (e) => {
                e.stopPropagation();
                if (result) {
                    const shareUrl = `https://neshan.org/maps?destination=${result.location.y},${result.location.x}`;
                    const shareText = `Check out ${result.title} on Neshan Maps!`;
                     if (navigator.share) {
                        navigator.share({
                            title: result.title,
                            text: shareText,
                            url: shareUrl,
                        }).catch(console.error);
                    } else {
                        // Fallback for browsers that don't support the Share API
                        navigator.clipboard.writeText(shareUrl).then(() => {
                            alert(`Link copied to clipboard: ${shareUrl}`);
                        }).catch(err => {
                             alert(`Could not copy link. Here it is: ${shareUrl}`);
                        });
                    }
                }
            });
        });
        
        updateResultsMap();
    };
    
    // --- MODALS ---
    const openNavModal = (lat, lng, title) => {
        const originLat = userLocation.lat;
        const originLng = userLocation.lng;
        const destLat = lat;
        const destLng = lng;

        if (originLat && originLng) {
            // Create web routing URLs if origin is known
            navNeshanLink.href = `https://neshan.org/maps/routing/car/origin/${originLat},${originLng}/destination/${destLat},${destLng}`;
            navGoogleLink.href = `https://www.google.com/maps/dir/?api=1&origin=${originLat},${originLng}&destination=${destLat},${destLng}`;
        } else {
            // Fallback to showing just the destination if origin is not available
            navNeshanLink.href = `https://neshan.org/maps?destination=${destLat},${destLng}`;
            navGoogleLink.href = `https://www.google.com/maps/search/?api=1&query=${destLat},${destLng}`;
        }
        
        navModal.classList.remove('hidden');
    };
    const closeNavModal = () => navModal.classList.add('hidden');

    const openLoginModal = () => loginModal.classList.remove('hidden');
    const closeLoginModal = () => {
        loginModal.classList.add('hidden');
        registerMessage.classList.add('hidden');
    }
    
    // --- EVENT LISTENERS ---
    const setupEventListeners = () => {
        langButtons.forEach(btn => btn.addEventListener('click', (e) => {
            const newLang = (e.currentTarget as HTMLElement).dataset.lang;
            if (newLang) {
                switchLanguage(newLang);
                languageDropdownMenu?.classList.add('hidden');
            }
        }));

        languageDropdownToggle?.addEventListener('click', (e) => {
            e.stopPropagation();
            languageDropdownMenu?.classList.toggle('hidden');
        });

        document.addEventListener('click', (e) => {
            const container = document.getElementById('language-dropdown-container');
            if (languageDropdownMenu && !languageDropdownMenu.classList.contains('hidden') && container && !container.contains(e.target as Node)) {
                 languageDropdownMenu.classList.add('hidden');
            }
        });

        siteNameBtn.addEventListener('click', () => {
            selectedSubCategories.clear();
            userLocation = { lat: null, lng: null };
            showPage(pageLocation);
        });
        themeToggleBtn.addEventListener('click', toggleTheme);

        useMyLocationBtn.addEventListener('click', handleUseMyLocation);
        provinceSelect.addEventListener('change', () => populateCounties(provinceSelect.value));
        countySelect.addEventListener('change', () => populateCities(provinceSelect.value, countySelect.value));
        cityVillageSelect.addEventListener('change', updateLocationUI);
        confirmLocationBtn.addEventListener('click', handleConfirmLocation);

        nextToCategoryBtn.addEventListener('click', goToCategoryPage);
        backToLocationBtn.addEventListener('click', () => showPage(pageLocation));
        searchBtn.addEventListener('click', handleQuickSearch);
        backToCategoryBtn.addEventListener('click', goToCategoryPage);
        newSearchBtn.addEventListener('click', () => {
             selectedSubCategories.clear();
             quickSearchInput.value = '';
             showPage(pageLocation)
        });

        quickSearchInput.addEventListener('keydown', (e) => {
            if (e.key === 'Enter') handleQuickSearch();
        });
        quickSearchInput.addEventListener('input', updateCategoryUI);
        
        backToMainCategoriesBtn.addEventListener('click', () => renderCategoryFilters());

        // Sort tabs
        sortNearestBtn?.addEventListener('click', () => {
            activeSortTab = 'nearest';
            sortAndRenderResults();
        });

        sortBestBtn?.addEventListener('click', () => {
            activeSortTab = 'best';
            sortAndRenderResults();
        });


        // Modals
        userIconBtn.addEventListener('click', openLoginModal);
        loginModalClose.addEventListener('click', closeLoginModal);
        navModalClose.addEventListener('click', closeNavModal);
        [navModal, loginModal].forEach(modal => {
            modal.addEventListener('click', (e) => {
                if (e.target === modal) {
                    modal.classList.add('hidden');
                    if(modal === loginModal) closeLoginModal();
                }
            });
        });
        
        registerBtn.addEventListener('click', () => {
            registerMessage.textContent = translations[currentLang]['register_under_development'];
            registerMessage.classList.remove('hidden');
        });

    };

    // --- INITIALIZATION ---
    showPage(pageLocation);
    const savedTheme = localStorage.getItem('whereis-theme');
    applyTheme(savedTheme === 'dark' ? 'dark' : 'light');
    switchLanguage(currentLang);
    populateProvinces();
    setupEventListeners();
    initializeLocationMap();
    updateLocationUI();
    updateCategoryUI();
};

// Start the application once the DOM is ready
document.addEventListener('DOMContentLoaded', initializeApplication);